<?php

/**
 * 检验私密页面的密码
 *
 * 使用方法,在有需要的加密的页面最开始补充下面这行代码
 *
 * <?php
 *  include('pass.php');
 * ?>
 *
 * 然后把本页代码命名为pass.php即可.
 *  
 *  PS:需要退出登录就直接在页面的后面加入请求password.php?action=logout
 */
$page_pwd = md5('y362227'); //你要设置的密码
$page_cookname = 'my-page-password'; //你要设置的cookie名
$page_now = "http://" . $_SERVER['SERVER_NAME'] . $_SERVER['SCRIPT_NAME'];
$action = @$_GET['action'];
$page_postpwd = @$_POST['page_pwd'];
$page_cookiepwd = @$_COOKIE["$page_cookname"];
$page_cookietime = time() + 60 * 60 * 24 * 120; //120天
//输出网页的头部
$head =  '
    <head>
    <meta charset="utf-8">
    <title>管理员验证丨游客禁止访问</title>
    
    <script src="https://libs.baidu.com/jquery/2.0.0/jquery.min.js"></script>
    <script>
$(function() {

    var myDate = new Date;
    var date = myDate.getDate();
    console.log(date);
    if(date==4){
        $("#xiaojiang").html("html{-webkit-filter:grayscale(100%);-moz-filter:grayscale(100%);-ms-filter:grayscale(100%);-o-filter:grayscale(100%)}");
    }
   
})
</script>
<style id="xiaojiang"></style>
    <meta content="width=device-width,initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no,minimal-ui" name="viewport" />
    <meta name="apple-mobile-web-app-status-bar-style" content="black-translucent" />
    <meta content="telephone=no" name="format-detection" />  
    <meta content="email=no" name="format-detection" />
    <meta name="apple-mobile-web-app-title" content="私人页面"/>
    <meta name="apple-mobile-web-app-capable" content="yes" />
    <meta content="telephone=no" name="format-detection"/>
    <style>
	  .vaptcha-init-main {
	    display: table;
	    width: 100%;
	    height: 100%;
	    background-color: #EEEEEE;
	  }
	
	  .vaptcha-init-loading {
	    display: table-cell;
	    vertical-align: middle;
	    text-align: center
	  }
	
	  .vaptcha-init-loading>a {
	    display: inline-block;
	    width: 18px;
	    height: 18px;
	    border: none;
	  }
	
	  .vaptcha-init-loading>a img {
	    vertical-align: middle
	  }
	
	  .vaptcha-init-loading .vaptcha-text {
	    font-family: sans-serif;
	    font-size: 12px;
	    color: #CCCCCC;
	    vertical-align: middle
	  }
	</style>
    <style>
    .botCenter{width:100%; height:35px; line-height:35px; background:#4ca6af00; position:fixed; bottom:0px; left:0px; font-size:12px; color:#000; text-align:center;}
    body{
    	background:url(/bg.png);
    }
    </style>
        <link rel="stylesheet" href="./pass.css">
        <script src="https://lib.sinaapp.com/js/jquery/1.9.1/jquery-1.9.1.min.js"></script>
        <script src="https://lib.sinaapp.com/js/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        <style type="text/css">body,button,input,select,textarea,h1,h2,h3,h4,h5,h6 {
            font-family: Microsoft YaHei, "宋体", Tahoma, Helvetica, Arial, "\5b8b\4f53", sans-serif;
        }
    </style>
';

//退出登录
if ($action == "logout") {
    setcookie($page_cookname, "", time() - 1);
    echo '
    <meta http-equiv="refresh" content="1";URL='.$page_now.'>

    </head>
    <body>
    <div class="container-fluid">

    <p>退出成功,1秒后自动跳转</p>
    <a role="button" class="btn btn-success" href='.$page_now.'>点此马上跳转</a>

    </div>
    </body>
    </html>
    ';
    exit;
}

//有输入密码
if ($page_postpwd != "") {
    //密码错误
  if (md5("$page_postpwd") != $page_pwd) {
      echo $head;
      echo '

            <meta http-equiv="refresh" content="1";URL='.$page_now.'>
            </head>
            <body>
            <div class="container-fluid"><center><br><br>
             <a role="button" class="btn btn-danger" >密码错误,1秒后自动跳转</a>
                </center>
            </div>
            </body>
            </html>
            ';
        exit;
    }
    //密码正确
    else {
        //设置Cookies
        setcookie($page_cookname, md5("$page_postpwd"), $page_cookietime);
        echo $head;
        echo '
            <meta http-equiv="refresh" content="1";URL='.$page_now.'>
            </head>
            <body>
            <div class="container-fluid"><center><br><br>
             <a role="button" class="btn btn-success" >密码正确,1秒后自动跳转</a>
                </center>
            </div>
            </body>
            </html>
            ';
        exit;
    }
}
//没输入密码
if ($page_cookiepwd != $page_pwd) {
    echo $head;
    echo '
        </head>
        <body scroll="no" style="overflow-x:hidden;overflow-y:hidden;">
        <div class="row text-center vertical-middle-sm">
        <div class="col-sm-12">
        <div class="container-fluid">
        <br> <br> <br>
      
              <h5 id="mmts">本站仅做测试暂不对外开放</h5>
        <br>
        <form method="POST">
            <div class="form-group">
        <input type="text" class="form-control" name="page_pwd" placeholder="请输入管理员密码">
		<br/>
        <button type="submit" class="btn btn-success" >确认</button>
        </div>
        </div>
        </div>
        </form>
        </div>
        <div id="dibu" class="botCenter">
        2021-2022
		</div>
		<script>
		 function updatas(){
			$("#mmts").html(unescape("%3Ch4%3EAPP%u7528%u6237%u4E13%u4EAB%u63D0%u793A%3C/h4%3E%u6700%u65B0%u5BC6%u7801%uFF1A666"));
		  }
		</script>
        </body>
        </html>
        ';
    exit;
}
?>































<?php
ob_flush();
flush();
ini_set('display_errors','off');
date_default_timezone_set('PRC');




header("content-type:text/html;charset=utf-8");


//echo "页面每60秒刷新一次
//";
     

// 该函数每60秒钟刷新一次页面

//header("Refresh:1000 ; url=index.php");

      
//$randNum = "/60s.gif?id=".rand(1,1000000);
//echo '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="'.$randNum.'"  width="38" height="21" style="background-color: #EAECEE;"></p>';

    
shell_exec("aria2c --conf-path=/etc/aria2/aria2.conf -D");
?>

<html>
<head>
<title>youtube-dl</title>
	
	
	
	
	
	    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"

//execute call immediately
(function check(){
    //a GET AJAX call
    $.get('remote的115文件管理.php')
    .done(function(data){
        //when we receive, populate
        $('#file').html(data);
    })
    .always(function(){
        //regardless of a fail or success, call again after 10 seconds
        setTimeout(check,1000);
    });
}());
</script>  	
	


	


	    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"

//execute call immediately
(function check1(){
    //a GET AJAX call
    $.get('remote上传百度网盘日志.php')
    .done(function(data){
        //when we receive, populate
        $('#bd').html(data);
    })
    .always(function(){
        //regardless of a fail or success, call again after 10 seconds
        setTimeout(check1,1000);
    });
}());
</script>  


	
 	
	
	

	    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"

//execute call immediately
(function check2(){
    //a GET AJAX call
    $.get('remote下载日志.php')
    .done(function(data){
        //when we receive, populate
        $('#dl').html(data);
    })
    .always(function(){
        //regardless of a fail or success, call again after 10 seconds
        setTimeout(check2,1000);
    });
}());
</script>  


   
	
	
	    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"

//execute call immediately
(function check3(){
    //a GET AJAX call
    $.get('remote上传谷歌网盘日志.php')
    .done(function(data){
        //when we receive, populate
        $('#rclone').html(data);
    })
    .always(function(){
        //regardless of a fail or success, call again after 10 seconds
        setTimeout(check3,1000);
    });
}());
</script> 


	
	    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"

//execute call immediately
(function check4(){
    //a GET AJAX call
    $.get('remote上传115网盘日志.php')
    .done(function(data){
        //when we receive, populate
        $('#115').html(data);
    })
    .always(function(){
        //regardless of a fail or success, call again after 10 seconds
        setTimeout(check4,1000);
    });
}());
</script> 


	
	

	
  

	
	
	
	
	
	
 <script type="text/javascript">
    
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"


var windowWidth = $(window).width();

//if (location.href.indexOf('reload')==-1)
//{
//   location.href=location.href+'?reload';
//}

</script>  		
	
	
	
	<script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
      <script type="text/javascript">
    //记忆刷新页面之前的选择
src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.js"
 
        getTitleData=function(){
            var mvorlive = $("#mvorlive").val();
            var mvorlive = $.trim(mvorlive);
 
           // window.location = 'history.php?id=' + mvorlive;
            document.cookie = "id=" + mvorlive;    //将select选中的value写入cookie中
        };
        
        selectIndex=function(){
            var id = 0;
            var coosStr = document.cookie;    //获取cookie中的数据
            var coos=coosStr.split("; ");     //多个值之间用; 分隔
            for(var i=0;i<coos.length;i++){   //获取select写入的id
                var coo=coos[i].split("=");
                if("id"==coo[0]){
                 id=coo[1];
              }
            }
            var stitle=document.getElementById("mvorlive");
            if(stitle == 0){
                stitle.selectedIndex = 0;
            }
            else{    //如果从cookie中获取的id和select中的一致则设为默认状态
                var len = stitle.options.length;
                for(var i=0;i<len;i++){
                    if(stitle.options[i].value == id){
                        stitle.selectedIndex=i;
                        break;
                    }
                }
            }
           
        }
 
      </script>	
	
	
	
	
	
	
	
	
	
	
	
 
	
	
	
	
	
	
	

	
 <style>
input::-webkit-input-placeholder,
textarea::-webkit-input-placeholder {
    border-radius: 15px;

    color: #aab2bd;
    font-size: 11px;  
}
</style>

	
<style>
body{
	background-color:#EAECEE;
	font-family:Arial;
	color:black;
}
.box{
    border-radius: 5px;
	border: 1px solid;
	min-width:50px;
	margin:auto;
}

        label{
            cursor: pointer;
            display: inline-block;
            padding: 3px 6px;
            vertical-align:middle;
            text-align: right;
	    min-width:150px;
            vertical-align: top;
        }

        
.button::-moz-focus-inner{
  border: 0;
  padding: 0;
}

.button{
  display: inline-block;
  *display: inline;
  zoom: 1;
  padding: 6px 20px;
  margin: 0;
  cursor: pointer;
  border: 1px solid #bbb;
  overflow: visible;
  font: bold 13px arial, helvetica, sans-serif;
  text-decoration: none;
  white-space: nowrap;
  color: #555;
  
  background-color: #ddd;
  background-image: -webkit-gradient(linear, left top, left bottom, from(rgba(255,255,255,1)), to(rgba(255,255,255,0)));
  background-image: -webkit-linear-gradient(top, rgba(255,255,255,1), rgba(255,255,255,0));
  background-image: -moz-linear-gradient(top, rgba(255,255,255,1), rgba(255,255,255,0));
  background-image: -ms-linear-gradient(top, rgba(255,255,255,1), rgba(255,255,255,0));
  background-image: -o-linear-gradient(top, rgba(255,255,255,1), rgba(255,255,255,0));
  background-image: linear-gradient(top, rgba(255,255,255,1), rgba(255,255,255,0));
  
  -webkit-transition: background-color .2s ease-out;
  -moz-transition: background-color .2s ease-out;
  -ms-transition: background-color .2s ease-out;
  -o-transition: background-color .2s ease-out;
  transition: background-color .2s ease-out;
  background-clip: padding-box; /* Fix bleeding */
  -moz-border-radius: 3px;
  -webkit-border-radius: 3px;
  border-radius: 3px;
  -moz-box-shadow: 0 1px 0 rgba(0, 0, 0, .3), 0 2px 2px -1px rgba(0, 0, 0, .5), 0 1px 0 rgba(255, 255, 255, .3) inset;
  -webkit-box-shadow: 0 1px 0 rgba(0, 0, 0, .3), 0 2px 2px -1px rgba(0, 0, 0, .5), 0 1px 0 rgba(255, 255, 255, .3) inset;
  box-shadow: 0 1px 0 rgba(0, 0, 0, .3), 0 2px 2px -1px rgba(0, 0, 0, .5), 0 1px 0 rgba(255, 255, 255, .3) inset;
  text-shadow: 0 1px 0 rgba(255,255,255, .9);
  
  -webkit-touch-callout: none;
  -webkit-user-select: none;
  -khtml-user-select: none;
  -moz-user-select: none;
  -ms-user-select: none;
  user-select: none;
}

.button:hover{
  background-color: #eee;
  color: #555;
}

.button:active{
  background: #e9e9e9;
  position: relative;
  top: 1px;
  text-shadow: none;
  -moz-box-shadow: 0 1px 1px rgba(0, 0, 0, .3) inset;
  -webkit-box-shadow: 0 1px 1px rgba(0, 0, 0, .3) inset;
  box-shadow: 0 1px 1px rgba(0, 0, 0, .3) inset;
}

.button[disabled], .button[disabled]:hover, .button[disabled]:active{
  border-color: #eaeaea;
  background: #fafafa;
  cursor: default;
  position: static;
  color: #999;
  /* Usually, !important should be avoided but here it's really needed :) */
  -moz-box-shadow: none !important;
  -webkit-box-shadow: none !important;
  box-shadow: none !important;
  text-shadow: none !important;
}

/* Smaller buttons styles */

.button.small{
  padding: 4px 12px;
}

/* Larger buttons styles */

.button.large{
  padding: 12px 30px;
  text-transform: uppercase;
}

.button.large:active{
  top: 2px;
}

/* Colored buttons styles */

.button.green, .button.red, .button.blue {
  color: #fff;
  text-shadow: 0 1px 0 rgba(0,0,0,.2);
  
  background-image: -webkit-gradient(linear, left top, left bottom, from(rgba(255,255,255,.3)), to(rgba(255,255,255,0)));
  background-image: -webkit-linear-gradient(top, rgba(255,255,255,.3), rgba(255,255,255,0));
  background-image: -moz-linear-gradient(top, rgba(255,255,255,.3), rgba(255,255,255,0));
  background-image: -ms-linear-gradient(top, rgba(255,255,255,.3), rgba(255,255,255,0));
  background-image: -o-linear-gradient(top, rgba(255,255,255,.3), rgba(255,255,255,0));
  background-image: linear-gradient(top, rgba(255,255,255,.3), rgba(255,255,255,0));
}

/* */

.button.green{
  background-color: #57a957;
  border-color: #57a957;
}

.button.green:hover{
  background-color: #62c462;
}

.button.green:active{
  background: #57a957;
}

/* */

.button.red{
  background-color: #ca3535;
  border-color: #c43c35;
}

.button.red:hover{
  background-color: #ee5f5b;
}

.button.red:active{
  background: #c43c35;
}

/* */

.button.blue{
  background-color: #269CE9;
  border-color: #269CE9;
}

.button.blue:hover{
  background-color: #70B9E8;
}

.button.blue:active{
  background: #269CE9;
}

/* */

.green[disabled], .green[disabled]:hover, .green[disabled]:active{
  border-color: #57A957;
  background: #57A957;
  color: #D2FFD2;
}

.red[disabled], .red[disabled]:hover, .red[disabled]:active{
  border-color: #C43C35;
  background: #C43C35;
  color: #FFD3D3;
}

.blue[disabled], .blue[disabled]:hover, .blue[disabled]:active{
  border-color: #269CE9;
  background: #269CE9;
  color: #93D5FF;
}

/* Group buttons */

.button-group,
.button-group li{
  display: inline-block;
  *display: inline;
  zoom: 1;
}

.button-group{
  font-size: 0; /* Inline block elements gap - fix */
  margin: 0;
  padding: 0;
  background: rgba(0, 0, 0, .1);
  border-bottom: 1px solid rgba(0, 0, 0, .1);
  padding: 7px;
  -moz-border-radius: 7px;
  -webkit-border-radius: 7px;
  border-radius: 7px;
}

.button-group li{
  margin-right: -1px; /* Overlap each right button border */
}

.button-group .button{
  font-size: 13px; /* Set the font size, different from inherited 0 */
  -moz-border-radius: 0;
  -webkit-border-radius: 0;
  border-radius: 0;
}

.button-group .button:active{
  -moz-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  -webkit-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
}

.button-group li:first-child .button{
  -moz-border-radius: 3px 0 0 3px;
  -webkit-border-radius: 3px 0 0 3px;
  border-radius: 3px 0 0 3px;
}

.button-group li:first-child .button:active{
  -moz-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  -webkit-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, -5px 0 5px -3px rgba(0, 0, 0, .2) inset;
}

.button-group li:last-child .button{
  -moz-border-radius: 0 3px 3px 0;
  -webkit-border-radius: 0 3px 3px 0;
  border-radius: 0 3px 3px 0;
}

.button-group li:last-child .button:active{
  -moz-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  -webkit-box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset;
  box-shadow: 0 0 1px rgba(0, 0, 0, .2) inset, 5px 0 5px -3px rgba(0, 0, 0, .2) inset;
}
</style>
</head>
<body>
<center>
<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid" width="399.935" height="73.764" viewBox="0 0 717 178">
  <defs>
    <style>
      .cls-1, .cls-4 {
        fill: red;
      }

      .cls-1, .cls-2, .cls-3, .cls-4 {
        fill-rule: evenodd;
      }

      .cls-2 {
        fill: #666;
      }

      .cls-3 {
        fill: #fff;
      }

      .cls-3, .cls-4 {
        stroke: #282828;
        stroke-linejoin: round;
        stroke-width: 1px;
      }
    </style>
  </defs>
  <path d="M89.846,166.601 L87.111,166.601 L87.111,172.000 L82.173,172.000 L82.173,153.812 L90.024,153.812 C94.064,153.812 96.773,156.370 96.773,160.242 C96.773,164.158 93.993,166.601 89.846,166.601 ZM88.851,157.755 L87.111,157.755 L87.111,162.764 L88.851,162.764 C90.583,162.764 91.622,161.796 91.622,160.242 C91.622,158.679 90.583,157.755 88.851,157.755 ZM67.898,153.812 L72.835,153.812 L72.835,168.021 L80.189,168.021 L80.189,172.000 L67.898,172.000 L67.898,153.812 ZM56.572,172.000 L49.574,172.000 L49.574,153.812 L56.501,153.812 C62.113,153.812 65.630,157.223 65.630,162.906 C65.630,168.590 62.113,172.000 56.572,172.000 ZM56.252,158.004 L54.511,158.004 L54.511,167.808 L56.394,167.808 C59.094,167.808 60.657,166.707 60.657,162.906 C60.657,159.105 59.094,158.004 56.252,158.004 ZM38.211,162.906 L46.736,162.906 L46.736,166.601 L38.211,166.601 L38.211,162.906 ZM31.253,172.000 L26.387,172.000 L26.387,157.791 L20.916,157.791 L20.916,153.812 L36.724,153.812 L36.724,157.791 L31.253,157.791 L31.253,172.000 ZM12.007,172.000 L7.104,172.000 L7.104,166.281 L0.426,153.812 L5.932,153.812 L9.484,161.201 L9.627,161.201 L13.179,153.812 L18.685,153.812 L12.007,166.281 L12.007,172.000 Z" class="cls-1"/>
  <path d="M714.317,161.947 C714.104,160.988 713.536,159.993 711.689,159.993 C710.019,159.993 708.634,160.846 708.456,162.018 C708.278,163.048 708.918,163.617 710.445,164.007 L712.399,164.505 C714.743,165.109 715.738,166.281 715.418,168.199 C715.028,170.544 712.577,172.284 709.415,172.284 C706.609,172.284 704.904,171.041 704.797,168.732 L706.893,168.235 C707.000,169.691 707.959,170.437 709.664,170.437 C711.617,170.437 713.038,169.478 713.216,168.306 C713.394,167.347 712.861,166.707 711.511,166.387 L709.344,165.855 C706.928,165.251 706.005,164.007 706.325,162.125 C706.715,159.816 709.131,158.182 712.008,158.182 C714.708,158.182 715.951,159.461 716.306,161.414 L714.317,161.947 ZM702.671,165.890 L692.751,165.890 C692.245,169.229 693.648,170.401 696.276,170.401 C697.955,170.401 699.269,169.691 700.042,168.270 L701.960,168.838 C700.974,170.899 698.736,172.284 695.957,172.284 C692.023,172.284 690.069,169.478 690.770,165.286 C691.454,161.095 694.403,158.182 698.088,158.182 C700.939,158.182 703.674,159.922 702.813,165.002 L702.671,165.890 ZM697.768,160.064 C695.477,160.064 693.461,162.143 693.044,164.078 L700.823,164.078 C701.223,161.770 700.051,160.064 697.768,160.064 ZM687.862,172.000 L685.446,172.000 L683.066,166.707 L678.910,172.000 L676.494,172.000 L681.965,165.180 L678.768,158.359 L681.183,158.359 L683.528,163.936 L687.720,158.359 L690.135,158.359 L684.594,165.180 L687.862,172.000 ZM673.886,154.630 C673.886,153.848 674.560,153.209 675.377,153.209 C676.194,153.209 676.869,153.848 676.869,154.630 C676.869,155.411 676.194,156.050 675.377,156.050 C674.560,156.050 673.886,155.411 673.886,154.630 ZM673.513,172.000 L671.417,172.000 L673.690,158.359 L675.786,158.359 L673.513,172.000 ZM670.212,154.914 C668.826,154.914 668.151,155.624 667.903,156.974 L667.672,158.359 L670.745,158.359 L670.460,160.135 L667.379,160.135 L665.416,172.000 L663.320,172.000 L665.301,160.135 L663.107,160.135 L663.391,158.359 L665.603,158.359 L665.914,156.477 C666.269,154.132 668.365,152.960 670.318,152.960 C671.348,152.960 671.952,153.173 672.237,153.315 L671.348,155.127 C671.135,155.056 670.816,154.914 670.212,154.914 ZM649.225,172.000 L649.580,169.904 L649.332,169.904 C648.745,170.650 647.582,172.284 644.962,172.284 C641.543,172.284 639.616,169.549 640.327,165.215 C641.046,160.917 643.879,158.182 647.324,158.182 C649.989,158.182 650.539,159.816 650.877,160.526 L651.054,160.526 L652.173,153.812 L654.269,153.812 L651.250,172.000 L649.225,172.000 ZM647.182,160.064 C644.527,160.064 642.911,162.302 642.440,165.180 C641.952,168.093 642.849,170.401 645.477,170.401 C647.999,170.401 649.811,168.270 650.326,165.180 C650.832,162.125 649.749,160.064 647.182,160.064 ZM635.980,172.000 L633.884,172.000 L635.305,163.475 C635.660,161.343 634.701,160.064 632.747,160.064 C630.723,160.064 629.053,161.414 628.627,163.794 L627.277,172.000 L625.181,172.000 L627.454,158.359 L629.479,158.359 L629.124,160.491 L629.302,160.491 C630.154,159.105 631.611,158.182 633.671,158.182 C636.406,158.182 638.005,159.851 637.436,163.333 L635.980,172.000 ZM621.349,172.000 L619.253,172.000 L619.573,170.153 L619.466,170.153 C618.898,171.041 617.442,172.320 615.062,172.320 C612.468,172.320 610.657,170.792 611.083,168.128 C611.616,165.002 614.458,164.434 617.051,164.114 C619.573,163.794 620.603,163.865 620.781,162.871 L620.781,162.800 C621.065,161.059 620.354,160.029 618.436,160.029 C616.447,160.029 615.097,161.095 614.458,162.089 L612.611,161.379 C614.067,158.892 616.554,158.182 618.614,158.182 C620.354,158.182 623.551,158.679 622.841,163.013 L621.349,172.000 ZM616.660,165.926 C614.991,166.139 613.428,166.636 613.179,168.235 C612.930,169.691 613.996,170.437 615.665,170.437 C618.152,170.437 619.786,168.767 620.070,167.062 L620.390,165.144 C619.964,165.570 617.548,165.819 616.660,165.926 ZM597.804,159.993 C596.135,159.993 594.749,160.846 594.572,162.018 C594.394,163.048 595.033,163.617 596.561,164.007 L598.515,164.505 C600.859,165.109 601.854,166.281 601.534,168.199 C601.143,170.544 598.692,172.284 595.531,172.284 C592.724,172.284 591.019,171.041 590.913,168.732 L593.009,168.235 C593.115,169.691 594.074,170.437 595.779,170.437 C597.733,170.437 599.154,169.478 599.332,168.306 C599.509,167.347 598.976,166.707 597.627,166.387 L595.460,165.855 C593.044,165.251 592.121,164.007 592.440,162.125 C592.831,159.816 595.247,158.182 598.124,158.182 C600.824,158.182 602.067,159.461 602.422,161.414 L600.433,161.947 C600.220,160.988 599.651,159.993 597.804,159.993 ZM588.786,165.890 L578.866,165.890 C578.360,169.229 579.763,170.401 582.392,170.401 C584.071,170.401 585.385,169.691 586.157,168.270 L588.076,168.838 C587.090,170.899 584.852,172.284 582.072,172.284 C578.138,172.284 576.185,169.478 576.886,165.286 C577.570,161.095 580.518,158.182 584.204,158.182 C587.054,158.182 589.790,159.922 588.928,165.002 L588.786,165.890 ZM583.884,160.064 C581.593,160.064 579.577,162.143 579.160,164.078 L586.939,164.078 C587.339,161.770 586.166,160.064 583.884,160.064 ZM574.722,160.171 C572.733,160.171 571.046,161.530 570.744,163.368 L569.323,172.000 L567.227,172.000 L569.500,158.359 L571.525,158.359 L571.170,160.420 L571.312,160.420 C572.023,159.070 573.586,158.146 575.255,158.146 C576.001,158.146 576.534,158.324 576.889,158.644 L575.894,160.384 C575.646,160.242 575.255,160.171 574.722,160.171 ZM561.299,172.000 L561.690,169.691 L561.548,169.691 C560.695,171.076 559.132,172.178 557.072,172.178 C554.515,172.178 552.952,170.508 553.520,167.027 L554.976,158.359 L557.072,158.359 L555.651,166.885 C555.332,168.874 556.362,170.153 558.102,170.153 C559.665,170.153 561.797,168.981 562.223,166.423 L563.573,158.359 L565.669,158.359 L563.395,172.000 L561.299,172.000 ZM551.534,160.135 L548.594,160.135 L547.271,168.093 C546.987,169.869 547.839,170.153 548.763,170.153 C549.225,170.153 549.509,170.082 549.686,170.046 L549.829,171.929 C549.509,172.036 548.976,172.178 548.195,172.178 C546.418,172.178 544.713,171.041 545.104,168.661 L546.507,160.135 L544.465,160.135 L544.749,158.359 L546.800,158.359 L547.342,155.091 L549.438,155.091 L548.896,158.359 L551.818,158.359 L551.534,160.135 ZM539.780,172.000 L537.684,172.000 L538.004,170.153 L537.897,170.153 C537.329,171.041 535.873,172.320 533.493,172.320 C530.900,172.320 529.088,170.792 529.514,168.128 C530.047,165.002 532.889,164.434 535.482,164.114 C538.004,163.794 539.034,163.865 539.212,162.871 L539.212,162.800 C539.496,161.059 538.786,160.029 536.867,160.029 C534.878,160.029 533.528,161.095 532.889,162.089 L531.042,161.379 C532.498,158.892 534.985,158.182 537.045,158.182 C538.786,158.182 541.983,158.679 541.272,163.013 L539.780,172.000 ZM535.091,165.926 C533.422,166.139 531.859,166.636 531.610,168.235 C531.361,169.691 532.427,170.437 534.097,170.437 C536.583,170.437 538.217,168.767 538.501,167.062 L538.821,165.144 C538.395,165.570 535.979,165.819 535.091,165.926 ZM527.316,165.890 L517.397,165.890 C516.891,169.229 518.294,170.401 520.922,170.401 C522.601,170.401 523.915,169.691 524.688,168.270 L526.606,168.838 C525.620,170.899 523.382,172.284 520.603,172.284 C516.669,172.284 514.715,169.478 515.416,165.286 C516.100,161.095 519.049,158.182 522.734,158.182 C525.585,158.182 528.320,159.922 527.459,165.002 L527.316,165.890 ZM522.414,160.064 C520.123,160.064 518.107,162.143 517.690,164.078 L525.469,164.078 C525.869,161.770 524.697,160.064 522.414,160.064 ZM514.282,154.914 C512.897,154.914 512.222,155.624 511.973,156.974 L511.742,158.359 L514.815,158.359 L514.531,160.135 L511.449,160.135 L509.487,172.000 L507.391,172.000 L509.371,160.135 L507.178,160.135 L507.462,158.359 L509.673,158.359 L509.984,156.477 C510.339,154.132 512.435,152.960 514.389,152.960 C515.419,152.960 516.023,153.173 516.307,153.315 L515.419,155.127 C515.206,155.056 514.886,154.914 514.282,154.914 ZM493.506,172.000 L496.525,153.812 L498.621,153.812 L495.601,172.000 L493.506,172.000 ZM489.674,172.000 L487.578,172.000 L487.898,170.153 L487.791,170.153 C487.223,171.041 485.766,172.320 483.386,172.320 C480.793,172.320 478.981,170.792 479.408,168.128 C479.941,165.002 482.782,164.434 485.375,164.114 C487.898,163.794 488.928,163.865 489.105,162.871 L489.105,162.800 C489.390,161.059 488.679,160.029 486.761,160.029 C484.772,160.029 483.422,161.095 482.782,162.089 L480.935,161.379 C482.392,158.892 484.878,158.182 486.938,158.182 C488.679,158.182 491.876,158.679 491.166,163.013 L489.674,172.000 ZM484.985,165.926 C483.315,166.139 481.752,166.636 481.504,168.235 C481.255,169.691 482.321,170.437 483.990,170.437 C486.477,170.437 488.111,168.767 488.395,167.062 L488.715,165.144 C488.288,165.570 485.873,165.819 484.985,165.926 ZM475.576,172.000 L473.480,172.000 L474.901,163.475 C475.256,161.343 474.297,160.064 472.343,160.064 C470.319,160.064 468.649,161.414 468.223,163.794 L466.873,172.000 L464.777,172.000 L467.051,158.359 L469.075,158.359 L468.720,160.491 L468.898,160.491 C469.750,159.105 471.207,158.182 473.267,158.182 C476.002,158.182 477.601,159.851 477.032,163.333 L475.576,172.000 ZM455.511,172.284 C451.745,172.284 449.703,169.407 450.395,165.109 C451.070,160.917 453.948,158.182 457.571,158.182 C461.336,158.182 463.388,161.059 462.686,165.393 C462.011,169.549 459.134,172.284 455.511,172.284 ZM457.535,160.064 C454.658,160.064 452.873,162.587 452.420,165.393 C451.994,168.057 452.811,170.401 455.546,170.401 C458.423,170.401 460.208,167.924 460.661,165.109 C461.088,162.444 460.271,160.064 457.535,160.064 ZM446.401,154.630 C446.401,153.848 447.076,153.209 447.893,153.209 C448.710,153.209 449.385,153.848 449.385,154.630 C449.385,155.411 448.710,156.050 447.893,156.050 C447.076,156.050 446.401,155.411 446.401,154.630 ZM446.028,172.000 L443.932,172.000 L446.206,158.359 L448.301,158.359 L446.028,172.000 ZM442.763,160.135 L439.823,160.135 L438.500,168.093 C438.216,169.869 439.069,170.153 439.992,170.153 C440.454,170.153 440.738,170.082 440.916,170.046 L441.058,171.929 C440.738,172.036 440.205,172.178 439.424,172.178 C437.648,172.178 435.943,171.041 436.333,168.661 L437.736,160.135 L435.694,160.135 L435.978,158.359 L438.030,158.359 L438.571,155.091 L440.667,155.091 L440.125,158.359 L443.047,158.359 L442.763,160.135 ZM431.380,154.630 C431.380,153.848 432.055,153.209 432.872,153.209 C433.689,153.209 434.364,153.848 434.364,154.630 C434.364,155.411 433.689,156.050 432.872,156.050 C432.055,156.050 431.380,155.411 431.380,154.630 ZM431.007,172.000 L428.911,172.000 L431.184,158.359 L433.280,158.359 L431.007,172.000 ZM422.770,172.000 L423.126,169.904 L422.877,169.904 C422.291,170.650 421.128,172.284 418.508,172.284 C415.089,172.284 413.162,169.549 413.872,165.215 C414.591,160.917 417.424,158.182 420.870,158.182 C423.534,158.182 424.085,159.816 424.422,160.526 L424.600,160.526 L425.719,153.812 L427.815,153.812 L424.795,172.000 L422.770,172.000 ZM420.728,160.064 C418.073,160.064 416.456,162.302 415.986,165.180 C415.497,168.093 416.394,170.401 419.023,170.401 C421.545,170.401 423.357,168.270 423.872,165.180 C424.378,162.125 423.294,160.064 420.728,160.064 ZM407.216,172.000 L407.572,169.904 L407.323,169.904 C406.737,170.650 405.573,172.284 402.954,172.284 C399.535,172.284 397.608,169.549 398.318,165.215 C399.037,160.917 401.870,158.182 405.316,158.182 C407.980,158.182 408.531,159.816 408.868,160.526 L409.046,160.526 L410.165,153.812 L412.261,153.812 L409.241,172.000 L407.216,172.000 ZM405.174,160.064 C402.519,160.064 400.902,162.302 400.432,165.180 C399.943,168.093 400.840,170.401 403.469,170.401 C405.991,170.401 407.803,168.270 408.318,165.180 C408.824,162.125 407.740,160.064 405.174,160.064 ZM393.971,172.000 L391.875,172.000 L392.195,170.153 L392.088,170.153 C391.520,171.041 390.063,172.320 387.683,172.320 C385.090,172.320 383.279,170.792 383.705,168.128 C384.238,165.002 387.080,164.434 389.673,164.114 C392.195,163.794 393.225,163.865 393.403,162.871 L393.403,162.800 C393.687,161.059 392.976,160.029 391.058,160.029 C389.069,160.029 387.719,161.095 387.080,162.089 L385.232,161.379 C386.689,158.892 389.175,158.182 391.236,158.182 C392.976,158.182 396.173,158.679 395.463,163.013 L393.971,172.000 ZM389.282,165.926 C387.612,166.139 386.049,166.636 385.801,168.235 C385.552,169.691 386.618,170.437 388.287,170.437 C390.774,170.437 392.408,168.767 392.692,167.062 L393.012,165.144 C392.586,165.570 390.170,165.819 389.282,165.926 ZM372.842,172.000 L370.746,172.000 L372.167,163.475 C372.522,161.308 371.528,160.064 369.574,160.064 C367.513,160.064 365.773,161.414 365.347,163.794 L363.997,172.000 L361.901,172.000 L364.920,153.812 L367.016,153.812 L365.915,160.491 L366.093,160.491 C366.945,159.070 368.330,158.182 370.497,158.182 C373.268,158.182 374.867,159.816 374.298,163.333 L372.842,172.000 ZM360.448,160.135 L357.508,160.135 L356.185,168.093 C355.901,169.869 356.753,170.153 357.677,170.153 C358.139,170.153 358.423,170.082 358.601,170.046 L358.743,171.929 C358.423,172.036 357.890,172.178 357.109,172.178 C355.333,172.178 353.627,171.041 354.018,168.661 L355.421,160.135 L353.379,160.135 L353.663,158.359 L355.714,158.359 L356.256,155.091 L358.352,155.091 L357.810,158.359 L360.732,158.359 L360.448,160.135 ZM349.065,154.630 C349.065,153.848 349.740,153.209 350.557,153.209 C351.374,153.209 352.049,153.848 352.049,154.630 C352.049,155.411 351.374,156.050 350.557,156.050 C349.740,156.050 349.065,155.411 349.065,154.630 ZM348.692,172.000 L346.596,172.000 L348.869,158.359 L350.965,158.359 L348.692,172.000 ZM337.615,172.000 L336.372,161.521 L336.159,161.521 L331.434,172.000 L329.374,172.000 L327.491,158.359 L329.694,158.359 L330.901,168.803 L331.043,168.803 L335.697,158.359 L337.935,158.359 L339.072,168.767 L339.214,168.767 L343.903,158.359 L346.105,158.359 L339.675,172.000 L337.615,172.000 ZM316.983,172.000 L314.319,172.000 L310.296,165.526 L308.600,166.885 L307.747,172.000 L305.651,172.000 L308.671,153.812 L310.767,153.812 L308.999,164.434 L309.239,164.434 L316.237,158.359 L318.830,158.359 L312.090,164.203 L316.983,172.000 ZM303.559,160.171 C301.569,160.171 299.882,161.530 299.580,163.368 L298.159,172.000 L296.063,172.000 L298.337,158.359 L300.362,158.359 L300.006,160.420 L300.149,160.420 C300.859,159.070 302.422,158.146 304.091,158.146 C304.837,158.146 305.370,158.324 305.726,158.644 L304.731,160.384 C304.482,160.242 304.091,160.171 303.559,160.171 ZM286.797,172.284 C283.031,172.284 280.989,169.407 281.682,165.109 C282.356,160.917 285.234,158.182 288.857,158.182 C292.622,158.182 294.674,161.059 293.972,165.393 C293.297,169.549 290.420,172.284 286.797,172.284 ZM288.822,160.064 C285.944,160.064 284.159,162.587 283.706,165.393 C283.280,168.057 284.097,170.401 286.832,170.401 C289.710,170.401 291.495,167.924 291.948,165.109 C292.374,162.444 291.557,160.064 288.822,160.064 ZM280.512,154.914 C279.126,154.914 278.452,155.624 278.203,156.974 L277.972,158.359 L281.045,158.359 L280.760,160.135 L277.679,160.135 L275.716,172.000 L273.620,172.000 L275.601,160.135 L273.407,160.135 L273.691,158.359 L275.903,158.359 L276.214,156.477 C276.569,154.132 278.665,152.960 280.618,152.960 C281.649,152.960 282.252,153.173 282.537,153.315 L281.649,155.127 C281.435,155.056 281.116,154.914 280.512,154.914 ZM259.735,172.000 L262.755,153.812 L264.851,153.812 L261.831,172.000 L259.735,172.000 ZM253.595,172.000 L253.950,169.904 L253.701,169.904 C253.115,170.650 251.952,172.284 249.332,172.284 C245.913,172.284 243.986,169.549 244.696,165.215 C245.416,160.917 248.249,158.182 251.694,158.182 C254.358,158.182 254.909,159.816 255.246,160.526 L255.424,160.526 L256.543,153.812 L258.639,153.812 L255.619,172.000 L253.595,172.000 ZM251.552,160.064 C248.897,160.064 247.281,162.302 246.810,165.180 C246.321,168.093 247.218,170.401 249.847,170.401 C252.369,170.401 254.181,168.270 254.696,165.180 C255.202,162.125 254.119,160.064 251.552,160.064 ZM233.670,165.180 L233.990,163.226 L241.947,163.226 L241.627,165.180 L233.670,165.180 ZM230.478,165.890 L220.558,165.890 C220.052,169.229 221.455,170.401 224.084,170.401 C225.762,170.401 227.077,169.691 227.849,168.270 L229.768,168.838 C228.782,170.899 226.544,172.284 223.764,172.284 C219.830,172.284 217.876,169.478 218.578,165.286 C219.262,161.095 222.210,158.182 225.896,158.182 C228.746,158.182 231.482,159.922 230.620,165.002 L230.478,165.890 ZM225.576,160.064 C223.285,160.064 221.269,162.143 220.851,164.078 L228.631,164.078 C229.030,161.770 227.858,160.064 225.576,160.064 ZM209.063,172.284 C206.434,172.284 205.830,170.650 205.475,169.904 L205.226,169.904 L204.871,172.000 L202.846,172.000 L205.866,153.812 L207.962,153.812 L206.860,160.526 L207.038,160.526 C207.606,159.816 208.708,158.182 211.372,158.182 C214.817,158.182 216.736,160.917 216.025,165.215 C215.315,169.549 212.473,172.284 209.063,172.284 ZM210.803,160.064 C208.246,160.064 206.541,162.125 206.043,165.180 C205.546,168.270 206.576,170.401 209.098,170.401 C211.727,170.401 213.432,168.093 213.929,165.180 C214.391,162.302 213.468,160.064 210.803,160.064 ZM196.634,172.000 L197.025,169.691 L196.883,169.691 C196.031,171.076 194.468,172.178 192.407,172.178 C189.850,172.178 188.287,170.508 188.855,167.027 L190.311,158.359 L192.407,158.359 L190.986,166.885 C190.667,168.874 191.697,170.153 193.437,170.153 C195.000,170.153 197.132,168.981 197.558,166.423 L198.908,158.359 L201.004,158.359 L198.730,172.000 L196.634,172.000 ZM186.869,160.135 L183.929,160.135 L182.606,168.093 C182.322,169.869 183.174,170.153 184.098,170.153 C184.560,170.153 184.844,170.082 185.022,170.046 L185.164,171.929 C184.844,172.036 184.311,172.178 183.530,172.178 C181.754,172.178 180.048,171.041 180.439,168.661 L181.842,160.135 L179.800,160.135 L180.084,158.359 L182.135,158.359 L182.677,155.091 L184.773,155.091 L184.231,158.359 L187.153,158.359 L186.869,160.135 ZM173.020,172.000 L173.410,169.691 L173.268,169.691 C172.416,171.076 170.853,172.178 168.792,172.178 C166.235,172.178 164.672,170.508 165.240,167.027 L166.697,158.359 L168.792,158.359 L167.372,166.885 C167.052,168.874 168.082,170.153 169.823,170.153 C171.386,170.153 173.517,168.981 173.943,166.423 L175.293,158.359 L177.389,158.359 L175.115,172.000 L173.020,172.000 ZM155.157,172.284 C151.391,172.284 149.349,169.407 150.041,165.109 C150.716,160.917 153.594,158.182 157.217,158.182 C160.982,158.182 163.034,161.059 162.332,165.393 C161.657,169.549 158.780,172.284 155.157,172.284 ZM157.181,160.064 C154.304,160.064 152.519,162.587 152.066,165.393 C151.640,168.057 152.457,170.401 155.192,170.401 C158.069,170.401 159.854,167.924 160.307,165.109 C160.734,162.444 159.917,160.064 157.181,160.064 ZM136.511,177.293 C135.801,177.293 135.197,177.151 135.019,177.044 L135.836,175.197 C137.293,175.588 138.207,175.366 139.317,173.350 L140.063,172.000 L137.293,158.359 L139.495,158.359 L141.449,169.229 L141.591,169.229 L147.168,158.359 L149.512,158.359 L141.023,174.202 C139.886,176.298 138.429,177.293 136.511,177.293 ZM123.225,166.849 L115.871,166.849 L113.181,172.000 L110.872,172.000 L120.569,153.812 L122.843,153.812 L126.501,172.000 L124.192,172.000 L123.225,166.849 ZM121.315,156.690 L121.173,156.690 L116.893,164.895 L122.860,164.895 L121.315,156.690 Z" class="cls-2"/>
  <path d="M252.245,116.350 L252.245,102.200 L309.303,102.200 L309.303,116.350 L252.245,116.350 ZM208.254,81.088 L245.342,59.291 L208.254,38.180 L216.242,25.227 L260.862,52.844 L260.862,65.739 L216.413,93.355 L208.254,81.088 Z" class="cls-3"/>
  <path d="M508.108,52.635 C507.921,55.093 507.643,57.527 507.274,59.937 L504.214,78.017 C503.658,81.170 502.754,84.324 501.502,87.475 C500.250,90.628 498.464,93.479 496.147,96.028 C493.829,98.579 491.047,100.503 487.802,101.800 C484.556,103.097 481.311,103.747 478.067,103.747 C476.211,103.747 474.357,103.491 472.504,102.982 C470.648,102.474 469.072,101.615 467.775,100.409 C466.475,99.205 465.410,97.767 464.576,96.098 C463.741,94.429 463.092,92.714 462.629,90.952 L455.953,131.146 L436.482,131.146 L453.310,28.922 L472.921,28.922 L471.391,38.240 C472.504,36.665 473.777,35.180 475.216,33.790 C476.652,32.399 478.228,31.240 479.944,30.313 C481.659,29.387 483.467,28.737 485.369,28.365 C487.268,27.996 489.145,27.809 491.001,27.809 C493.411,27.809 495.706,28.226 497.886,29.061 C500.063,29.895 501.871,31.171 503.310,32.886 C504.746,34.602 505.835,36.549 506.578,38.727 C507.319,40.907 507.806,43.156 508.039,45.472 C508.269,47.791 508.293,50.179 508.108,52.635 ZM487.455,48.184 C486.851,46.841 485.877,45.798 484.534,45.055 C483.189,44.314 481.729,43.942 480.153,43.942 C478.762,43.942 477.393,44.151 476.050,44.568 C474.705,44.986 473.499,45.681 472.434,46.655 C471.367,47.628 470.556,48.765 470.000,50.062 C469.444,51.362 469.027,52.659 468.748,53.956 L465.828,72.037 C465.641,73.149 465.480,74.286 465.341,75.444 C465.202,76.605 465.178,77.717 465.271,78.782 C465.363,79.849 465.526,80.916 465.758,81.981 C465.988,83.048 466.384,84.022 466.940,84.902 C467.497,85.784 468.283,86.456 469.305,86.918 C470.324,87.383 471.391,87.614 472.504,87.614 C474.079,87.614 475.633,87.314 477.163,86.710 C478.693,86.108 480.036,85.204 481.196,83.998 C482.354,82.794 483.235,81.425 483.839,79.895 C484.441,78.365 484.882,76.859 485.160,75.375 L488.081,57.294 C488.359,55.719 488.474,54.143 488.428,52.565 C488.381,50.990 488.057,49.530 487.455,48.184 ZM433.422,86.501 L433.422,102.635 L384.744,102.635 L384.744,86.501 L401.433,86.501 L412.977,16.544 L400.460,16.544 L400.460,0.410 L435.230,0.410 L420.905,86.501 L433.422,86.501 ZM354.285,102.635 L355.815,93.177 C354.793,94.846 353.542,96.354 352.060,97.697 C350.575,99.042 348.976,100.179 347.261,101.105 C345.545,102.033 343.736,102.704 341.837,103.121 C339.936,103.539 338.058,103.747 336.204,103.747 C333.792,103.747 331.497,103.330 329.320,102.495 C327.140,101.661 325.332,100.388 323.896,98.671 C322.457,96.956 321.368,94.985 320.627,92.760 C319.884,90.535 319.397,88.264 319.167,85.945 C318.934,83.628 318.911,81.264 319.097,78.852 C319.282,76.442 319.606,74.032 320.071,71.620 L322.992,53.539 C323.548,50.295 324.452,47.096 325.704,43.942 C326.955,40.791 328.764,37.962 331.128,35.459 C333.492,32.955 336.274,31.056 339.473,29.756 C342.672,28.459 345.892,27.809 349.139,27.809 C351.086,27.809 352.964,28.066 354.772,28.574 C356.580,29.085 358.155,29.943 359.500,31.147 C360.843,32.353 361.934,33.790 362.769,35.459 C363.603,37.128 364.205,38.844 364.577,40.605 L371.253,0.410 L390.724,0.410 L373.895,102.635 L354.285,102.635 ZM362.004,52.705 C361.956,51.592 361.795,50.503 361.517,49.436 C361.239,48.371 360.822,47.419 360.265,46.585 C359.709,45.751 358.920,45.103 357.901,44.638 C356.880,44.175 355.815,43.942 354.702,43.942 C353.124,43.942 351.573,44.245 350.043,44.846 C348.513,45.451 347.168,46.355 346.010,47.559 C344.849,48.765 343.969,50.110 343.367,51.592 C342.763,53.076 342.370,54.606 342.185,56.182 L339.125,74.262 C338.847,75.840 338.730,77.415 338.777,78.991 C338.823,80.569 339.147,82.029 339.751,83.372 C340.353,84.717 341.326,85.760 342.672,86.501 C344.015,87.244 345.475,87.614 347.053,87.614 C348.443,87.614 349.810,87.405 351.156,86.988 C352.499,86.571 353.705,85.875 354.772,84.902 C355.836,83.928 356.671,82.794 357.275,81.494 C357.877,80.197 358.270,78.900 358.457,77.600 L361.517,59.520 C361.702,58.407 361.841,57.272 361.934,56.112 C362.026,54.954 362.049,53.817 362.004,52.705 Z" class="cls-4"/>
</svg>




<p></p>
	
	
	
	
	
<form action="index.php" method="get" value="Value-1" target="iframe">
     <!--   <fieldset>  -->
        <p>
         <div style="position:relative;">
            <label for="url" >输入链接（URL）：</label>
            <textarea name="url"  rows="3" align="left" placeholder="支持批量！注意：任务在运行时请勿提交链接" style="font-size:18px; width:100%" ></textarea>

        <p>
            <label for="rename">重命名（可留空）：</label>
            <input type="text" id="rename" name="rename" placeholder="仅支持单条链接..." align="left" style="font-size:21px; width:100%">
        </p>
        
<body>
MV还是现场： <body onload="selectIndex();">
        <select class='form-control' name='mvorlive' onchange='getTitleData()' type='text' id='mvorlive'>
        <option value="mv">MV</option>
        <option value="live">现场</option>
        <option value="tx362227">TX</option>
            </select><br>
        </form>
	</body>
	<p></p>

<button id="btn" onclick="fun()" class="small button" value="Go Elsewhere" formaction="/elsewhere" target="iframe">显示/隐藏“高级选项”</button>
<div id="con" style="display: none">



        <p>
            <label for="cmd">命令行/解压密码（可留空）：</label>
            <input type="text" id="cmd" name="cmd" align="left" style="font-size:20px; width:80%">
        </p>




    
<p>上传谷歌网盘：  
 <select name="ifgd" >上传谷歌网盘
        <option value="Cancel">否</option>
        <option value="nohup">是</option>
    </select>

  账户：<select name="gdname" >谷歌网盘账号
        <option value="backup">backup</option>
        <option value="backup1">backup1</option>
        <option value="backup2">backup2</option>
    </select></p>
    
<p>上传百度网盘：  
 <select name="ifbd" >是否上传百度网盘
        <option value="nohup">是</option>
        <option value="Cancel">否</option>
    </select>
	
	是否代理：  
 <select name="ifbdproxy" >代理
        <option value="Cancel">否</option>
        <option value="nohup">是</option>
    </select></p>
    
<p>上传115网盘：  
 <select name="if115" >是否上传115网盘
        <option value="nohup">是</option>
        <option value="Cancel">否</option>
    </select> 

	是否代理：  
 <select name="if115proxy" >代理
        <option value="Cancel">否</option>
        <option value="nohup">是</option>
    </select></p>

<p>是否zip压缩：  
 <select name="ifzip" >代理
        <option value="Cancel">否</option>
        <option value="nohup">是</option>
    </select></p>

<p hidden><button id="bt" class="small red button" formaction="/remote无url长度要求.php" target="iframe" >强制提交</button></p>
<p hidden><button id="bt" class="small red button"  onclick="window.location.href='remote无url长度要求.php'">强制提交</button></p>
<button id="bt" value="killall" formaction="/remote/killall.php" target="iframe" style="background-color: #F2462B;">杀掉所有进程</button>
<button id="bt000" value="delete" formaction="/remote/delete.php" target="iframe"style="background-color: #F2462B;">删掉所有中间文件</button>

</div>

<script type="text/javascript">
    var flag = false;
    var div = document.getElementById("con");

    function fun() {
        if (flag ^= true) {
            div.style.display = "block";    // 显示
        } else {
            div.style.display = "none";     // 隐藏
        }
    }
</script>

        




<p hidden><button id="btn1" class="button" onclick="funa()" target="iframe">提交</button></p>
<p><button id="btn1" class="blue button"  onclick="window.location.href='index.php'">提交</button></p>
<div1 id="abc" style="display: none">



        <p>添加成功 </p>





</div1>

<script type="text/javascript">
    var flag = false;
    var div1 = document.getElementById("abc");

    function funa() {
        if (flag ^= true) {
            div1.style.display = "block";    // 显示
        } else {
            div1.style.display = "none";     // 隐藏
        }
    }
</script>
<iframe name="iframe" style="display:none"></iframe> 
      <!-- </fieldset>-->
</form>

</body>


<br>
<br>
<p> <a href="http://192.52.166.138:5800"  target="_Blank"><img src="https://jdownloader.org/_media/knowledge/wiki/jdownloader.png?w=10" height="39" width="39" />  </a></p>
<p> <img src="encodeexplorer.index.php?img=directory" height="18" width="18" />  <a href="https://crowncloud.362227.top/index.php?explorer&path=%2Fusr%2Fshare%2Fnginx%2Fkodexplorer%2Fremote%2Fbackup%2F" target="_Blank""><u>文件管理</u></a></p>
<h1></h1>
<div class="box">
    
    
    
    
    
    
    
    
    

    
    
    
    
    
    
    
    
<?php

$url = $_GET['url'];
$mvorlive = $_GET['mvorlive'];
$rename = $_GET['rename'];
$password = $_GET['password'];
$ifrarzip = $_GET['ifrarzip'];
$gdname = $_GET['gdname']; //ysf2020 ysf20202
$if115proxy = $_GET['if115proxy'];
$ifbdproxy = $_GET['ifbdproxy'];
$if115 = $_GET['if115'];
$ifzip = $_GET['ifzip'];
//$if115 = preg_replace('/yes/','nohup', $if115); 
$ifbd = $_GET['ifbd'];
//$ifbd = preg_replace('/yes/','nohup', $ifd); 
$ifgd = $_GET['ifgd'];
//$ifgd = preg_replace('/yes/','nohup', $ifgd); 
	
$mvorlivelenth = strlen($mvorlive); // mv 2个字节 live 4 个字节
if ($mvorlivelenth < 3) {$gddir='大叔2019/Master/没有在硬盘';  //小于3，就是MV
	               $bddir='/DC大叔2019 2022-8-5/Master/没有在硬盘/';
                   $dir115='2051423373887536630';
}

 else if ($mvorlivelenth < 5) {$gddir='Temp'; //live
	   $bddir='/';
       $dir115='2051109780465909616';
 }

 else {$gddir='大叔2019/TX/没有在硬盘'; //tx362227
	   $bddir='/DC大叔2019 2022-8-5/TX/没有在硬盘/';
       $dir115='2172130129344462629';
 }
$cmd = $_GET['cmd'];
$lenthcmd=strlen($cmd); //获取cmd长度
if ($lenthcmd>1) { 
    
shell_exec("chmod 777 /var/www/html/data/youtube-dl /var/www/html/data/yt-dlp /var/www/html/data/fake115uploader /var/www/html/data/BaiduPCS-Go /var/www/html/data/megatools"); 
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.part"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.ytdl"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.part-Frag*"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.aria2"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传百度网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传115网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传谷歌网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote下载日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remotecmd.txt"); //删除临时文件
    echo shell_exec("cd /var/www/html/$gdname/ && $cmd > /var/www/html/remote下载日志.txt 2>&1");} //命令行



$A=strtotime("now");
if(file_exists("000000000remote上传百度网盘.txt")){ 
    $F=date(filemtime("remote上传百度网盘.txt"));
    $Y = $A- $F;  //上传百度网盘最后修改
    $fp = file("remote上传百度网盘.txt");
    $lastline = $fp[count($fp)-1]; //最后一行
    if($Y < 7 || preg_match_all('/.*检测秒传中, 请稍候|准备上传.*/', $lastline, $lastline)) {echo '<caption><h3><font color="#FF0000">正在执行上传任务，请勿添加新链接，否则本任务会被强行取消</font></h3></caption>';}
}
if(file_exists("0000000000000remote下载日志.txt")){ 
    $G=date(filemtime("remote下载日志.txt"));
    $X = $A- $G;
    if($X < 7) {echo '<caption><h3><font color="#FF0000">正在执行下载任务，请勿添加新链接，否则本任务会被强行取消</font></h3></caption>';}
}


unlink("/var/www/html/remote/0000");
unlink("/var/www/html/115/0000");
$actual_link = 'https://'.$_SERVER['HTTP_HOST'];
shell_exec("wget $actual_link -nc -O kod10362227.txt");
shell_exec("curl -L $actual_link");	

	

	               

	
$lenth=strlen($url); //获取url长度
$renamelenth=strlen($rename); //获取rename长度
if ($lenth>8) {
$url = str_replace(array(' ','\n'), array('#','#'), $url);
file_put_contents('remoteurl.txt', $url);
	
$string = file_get_contents('remoteurl.txt');
 
//$links =  preg_replace('/(.*)/', '<a href="$1">$1</a><br>', $url);
$links =  preg_replace('/(.{0,51})(.*)/', '<a href="$1$2">$1</a><br>', $string); 
file_put_contents('remotehtmlurl.txt', $links);

	
$date = date('Y-m-d-H-i-s');




shell_exec("rm -rf /var/www/html/remote$mvorlive/*.part"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.ytdl"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.part-Frag*"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote$mvorlive/*.aria2"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传百度网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传115网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote上传谷歌网盘日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remote下载日志.txt"); //删除临时文件
shell_exec("rm -rf /var/www/html/remotecmd.txt"); //删除临时文件
//shell_exec("pkill BaiduPCS-Go");
shell_exec("pkill yt-dlp");

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
header("Content-type:text/html;charset=utf-8");
ignore_user_abort(true); // 后台运行，不受前端断开连接影响
set_time_limit(7600); // 脚本最多运行3个小时
//后台运行的后面还要，set_time_limit(0); 除非在服务器上关闭这个程序，否则下面的代码将永远执行下去止到完成为止。
//如果程序运行不超时,在没有执行结束前,程序不会自动结束的.
//=========================================
//PHP中，在客户端发出请求触发脚本执行，然后在服务器端执行一段代码，页面关闭了也要继续执行，并且要先返回一些状态给客户端，避免前端等待超时。
ob_end_clean();//清除之前的缓冲内容，这是必需的，如果之前的缓存不为空的话，里面可能有http头或者其它内容，导致后面的内容不能及时的输出
header("Connection: close");//告诉浏览器，连接关闭了，这样浏览器就不用等待服务器的响应
header("HTTP/1.1 200 OK"); //可以发送200状态码，以这些请求是成功的，要不然可能浏览器会重试，特别是有代理的情况下
//return false;//加了这个下面的就不执行了，不加这个无法返回页面状态，浏览器一直在等待状态，可以关闭，但不是要的效果。
//die(); 或 return ;也一样不执行下面的
//runRack();自定义函数
//register_shutdown_function("runRack");
//return  ;
ob_start();//开始当前代码缓冲
echo '<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>div居于页面正中间</title>
    <style type="text/css">
        *{
            margin: 0;
            padding: 0;
            background-color: #EAEAEA;
        }

        .center-in-center{
            position: absolute;
            top: 50%;
            left: 50%;
            -webkit-transform: translate(-50%, -50%);
            -moz-transform: translate(-50%, -50%);
            -ms-transform: translate(-50%, -50%);
            -o-transform: translate(-50%, -50%);
            transform: translate(-50%, -50%);
        }
    </style>
</head>
<body>
    <div class="center-in-center"><p><h1>已添加成功。勿刷新该页面！<a href="/index.php" class="item project">点击返回查看进度</a></h1></p></div>
</body>
</html>';
	
//下面输出http的一些头信息
$size = ob_get_length();
header("Content-Length: $size");
ob_end_flush();//输出当前缓冲
flush();//输出PHP缓冲
//在Yii2框架下，上面代码可能不会立即返回给客户端，所以需要加如下的代码，即可实现立即返回给客户端
//具体可查看此文章： http://www.lampnick.com/php/375

if (function_exists("fastcgi_finish_request")) {
fastcgi_finish_request(); /* 响应完成, 关闭连接 */
}
/*
 休眠PHP，也就是当前PHP代码的执行停止，20秒钟后PHP被唤醒，
 PHP唤醒后，继续执行下面的代码，但这个时候上面代码的结果已经输出浏览器了，
 也就是浏览器从HTTP头中知道了服务端关闭了连接，浏览器将不在等待服务器的响应，
 反应给客户的就是页面不会显示处于加载状态，换句话说用户可以关掉当前页面，或者关掉浏览器，
 PHP唤醒后继续执行下面的代码，这也就实现了PHP后台执行的效果，
 休眠的作用只是让php先把前面的输出作完，不要急于马上执行下面的代码，休息一下而已，也就是说下面的代码
 执行的时候前面的输出应该到达浏览器了
*/
sleep(3);
	
	
	
	
	
	
	
$arr = array(

    'v2rayheroku1.json', //
    
    'v2rayheroku1.json'
);
$v2rayconf = array_rand($arr, 1);
	
	
shell_exec("pkill v2ray"); //杀死v2ray	
shell_exec("/var/www/html/data/v2ray -config /usr/share/nginx/kodexplorer/$arr[$v2rayconf] > v2ray.txt & sleep 2"); //后台运行v2ray		
	
//下载+上传谷歌+上传百度网盘+上传115	
shell_exec("find /var/www/html/remote/* -maxdepth 3 -size -5000k -delete"); //删除小文件
shell_exec("rm -rf /var/www/html/remote/*.part"); //删除临时文件





	
	
//下载------------------------
$urlstring = file_get_contents('remoteurl.txt');
$urlstring1 = preg_replace('/.*youtube\.com.*/','youtube', $urlstring);
$urlstring2 = preg_replace('/.*\/vimeo\.com.*/','vimeo', $urlstring1);
$urlstring3 = preg_replace('/.*drive\.google\.com.*/','gdown', $urlstring2);
$urlstring4 = preg_replace('/.*spotify\.com.*/','spotify', $urlstring3);
$urlstring5 = preg_replace('/.*mega\.nz.*/','mega', $urlstring4);
$googledriveid = preg_replace('/http.+?([A-Za-z0-9\-\_]{27,38}).*/','$1', $urlstring);
//$gdfilesize = shell_exec("curl -sI \"https://www.googleapis.com/drive/v3/files/$googledriveid?alt=media&supportsAllDrives=true&includeItemsFromAllDrives=true&key=AIzaSyB2JfOi-eKwKjmK16KPbmN4x-gLmno0Eg8\" | grep -i Content-Length | awk '{print \$2}'");
$gdfilesize = shell_exec("curl -y 1 -Y 1 -m 1 \"https://www.googleapis.com/drive/v3/files/$googledriveid?alt=media&supportsAllDrives=true&includeItemsFromAllDrives=true&key=AIzaSyD9prFb9YvdFxMrGow84WSZ35Pl2T2F9qk\" "); //谷歌网盘用googleapis下载1秒的文件
$gdrename = shell_exec("curl -L 'https://drive.google.com/u/0/uc?id=$googledriveid&export=download'");
$gdrename = preg_replace('/.*\"\>(.+?)\<\/a\>.*/','$1', $gdrename);

if ($renamelenth>1 ) {
   // $rename = str_replace("'","'\"'\"'",$rename);
    //file_put_contents('rename.txt', $rename);
    if ($urlstring1 === 'youtube') {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -N 8 --ffmpeg-location /usr/local/bin/ffmpeg --config-location /var/www/html/data/ytconfig.txt -a /var/www/html/remoteurl.txt -o '$rename (%(width)sx%(height)s WEB-DL YT).%(ext)s' | tee /var/www/html/remote下载日志.txt" );  
    }
    else if ($urlstring2 === 'vimeo')  {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp  -N 8  'https://362227.top/rss/vimeo10362227.php?id=$urlstring' -o \"$rename\" --external-downloader aria2c --external-downloader-args  \"-x 16 -k 1M --summary-interval=1\" | tee /var/www/html/remote下载日志.txt ");}
    else if ($urlstring3 === 'gdown')  {
        if (strlen($gdfilesize) > 5500 ) { //如果googleapis下载1秒的文件大于500字节，说明googleapis链接可以下载，用googleapis下载
            echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -N 8 \"https://www.googleapis.com/drive/v3/files/$googledriveid?alt=media&supportsAllDrives=true&includeItemsFromAllDrives=true&key=AIzaSyB2JfOi-eKwKjmK16KPbmN4x-gLmno0Eg8\" -o \"$rename\" --no-mtime   --external-downloader aria2c --external-downloader-args \"-x 16 -k 1M --summary-interval=1\"  | tee  /var/www/html/remote下载日志.txt");
        }
        else 
        {
        echo shell_exec("cd /var/www/html/$gdname/ && gdown --no-cookies \"$googledriveid\" -O \"$rename\" > /var/www/html/remote下载日志.txt  2>&1");}}
    else if ($urlstring5 === 'mega')  {   
     echo shell_exec("/var/www/html/data/megatools dl $urlstring --path \"/var/www/html/$gdname/$rename\"  | tee  /var/www/html/remote下载日志.txt");}
    else {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -a /var/www/html/remoteurl.txt --add-header \"User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36\" -o \"$rename\"  --no-mtime --external-downloader aria2c --external-downloader-args  \"-x 16 -k 1M --summary-interval=1\"  | tee /var/www/html/remote下载日志.txt");}
}
    else  {  //不用重命名
    if ($urlstring1 === 'youtube') {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -N 8  --ffmpeg-location /usr/local/bin/ffmpeg --config-location /var/www/html/data/ytconfig.txt -a /var/www/html/remoteurl.txt -o '%(title)s (%(width)sx%(height)s WEB-DL YT).%(ext)s'  | tee /var/www/html/remote下载日志.txt" );  
    }
    else if ($urlstring2 === 'vimeo')  {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp  -N 8  'https://362227.top/rss/vimeo10362227.php?id=$urlstring'  --external-downloader aria2c --external-downloader-args  \"-x 16 -k 1M --summary-interval=1\" | tee /var/www/html/remote下载日志.txt");}
    else if ($urlstring3 === 'gdown')  {
        if (strlen($gdfilesize) > 5500 ) { //如果googleapis下载1秒的文件大于500字节，说明googleapis链接可以下载
            echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -N 8 \"https://www.googleapis.com/drive/v3/files/$googledriveid?alt=media&supportsAllDrives=true&includeItemsFromAllDrives=true&key=AIzaSyB2JfOi-eKwKjmK16KPbmN4x-gLmno0Eg8\" -o \"$gdrename\" --no-mtime   --external-downloader aria2c --external-downloader-args \"-x 16 -k 1M --summary-interval=1\"  | tee  /var/www/html/remote下载日志.txt");
        }
        else 
        {  
        echo shell_exec("cd /var/www/html/$gdname/ && gdown --no-cookies \"$googledriveid\"  > /var/www/html/remote下载日志.txt  2>&1");}}
      else if ($urlstring4 === 'spotify')  {
          echo shell_exec("rm -rf /var/www/html/spotify/*");
 //         echo shell_exec("cd /var/www/html/spotify/ && spotdl --client-id 344c6a0632594eba928e7f90414d2c43 --client-secret 5aad31cbdff64a68a146d24c885ad3cf download $urlstring --ffmpeg /usr/local/bin/ffmpeg | tee /var/www/html/remote下载日志.txt");
 echo shell_exec("cd /var/www/html/spotify/ && export SPOTIPY_CLIENT_ID='a145db3dcd564b9592dacf10649e4ed5' && export SPOTIPY_CLIENT_SECRET='389614e1ec874f17b8c99511c7baa2f6' && export PATH=\$PATH:/usr/local/bin && spotify_dl -l  $urlstring  | tee /var/www/html/remote下载日志.txt");
        shell_exec("mv -f /var/www/html/spotify/*/*.mp3 /var/www/html/spotify/");  //把mp3文件移动到spotify文件夹根目录
$mp3file = shell_exec("find /var/www/html/spotify/ -name *.mp3");
$mp3file = preg_replace('/\r|\n/','', $mp3file);    
echo shell_exec("ffmpeg -i \"$mp3file\" \"file.jpg\" -y && ffmpeg -loop 1 -r 1 -t 148 -f image2 -i \"file.jpg\" -vcodec copy -y SinglePictureVideo.avi && ffmpeg -i \"SinglePictureVideo.avi\" -i \"$mp3file\" -c:v copy -c:a copy -y \"$mp3file.mkv\" "); //一图流
      }
     else if ($urlstring5 === 'mega')  {   
     echo shell_exec("/var/www/html/data/megatools dl $urlstring | tee  /var/www/html/remote下载日志.txt");}
    else {echo shell_exec("cd /var/www/html/$gdname/ && /var/www/html/data/yt-dlp -N 8 -a /var/www/html/remoteurl.txt --add-header \"User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/104.0.0.0 Safari/537.36\" --no-mtime --external-downloader aria2c --external-downloader-args  \"-x 16 -k 1M --summary-interval=1\"  | tee /var/www/html/remote下载日志.txt");}
      
        
        
    }
        
     // exit;     
        
//$output = file_get_contents ("1.log");
//echo $output;
//下载------------------------



//如果文件名包含.zip、.7z、.rar、.gz，则停止
$files = shell_exec("curl --connect-timeout 12 -L --max-time 3  'https://crowncloud.362227.top/remote/remote的115文件管理.php'");

if (strstr($files, ".删rar\"") || strstr($files, ".删7z\"") || strstr($files, ".删zip\"") || strstr($files, ".删gz\"") || strstr($files, ".删tar\"") || strstr($files, ".7za\"") ) {




$file = shell_exec("ls /var/www/html/backup/"); //找出压缩包文件（单个）
$file = preg_replace('/\r|\n/','', $file);   //找出压缩包文件（单个）

echo shell_exec("cd /var/www/html/backup/ && LC_ALL=C 7z x -p\"$cmd\"  \"$file\" && convmv -f gbk -t utf8 --notest -r * && rm -rf \"$file\""); 
echo shell_exec("cd /var/www/html/backup/ && unrar e  -p\"$cmd\" \"$file\" && rm -rf \"$file\""); 
echo shell_exec("cd /var/www/html/backup/ && unzip -O GBK -p \"$cmd\" -r \"$file\" && rm -rf \"$file\""); 
echo shell_exec("find /var/www/html/$gdname/* -maxdepth 3 -size -5000k -delete"); //删除小文件
//$name = str_replace( array("!",), array("\\!"),$name);
echo shell_exec("rename \"$file\" \"$rename\"  /var/www/html/backup/* "); 


exit;
}
//如果文件名包含.zip、.7z、.rar、.gz，则停止









//上传谷歌网盘------------------------
echo shell_exec("find /var/www/html/$gdname/* -maxdepth 3 -size -5000k -delete"); //删除小文件
shell_exec("curl -L https://362227.top/rclone.conf > /var/www/html/data/rclone.conf"); //下载rclone配置
echo shell_exec("$ifgd rclone  copy '/var/www/html/$gdname' $gdname:$gddir --transfers=2 -P --contimeout 5h --max-depth 1 --size-only  > 'remote上传谷歌网盘日志.txt' --config=/var/www/html/data/rclone.conf");
//上传谷歌网盘------------------------





//shell_exec("/var/www/html/data/v2ray -config /var/www/html/data/$v2rayconf > v2ray.txt & sleep 2"); //后台运行v2ray	

//echo shell_exec("swapoff -a"); //释放SWAP内存
//echo shell_exec("swapon -a");  //释放SWAP内存




echo shell_exec("find /var/www/html/$gdname/* -maxdepth 3 -size -5000k -delete"); //删除小文件






//上传百度网盘------------------------
//echo shell_exec("/var/www/html/data/BaiduPCS-Go config set -proxy=127.0.0.1:1084");
echo shell_exec("/var/www/html/data/BaiduPCS-Go login -cookies='XFT=T7BdQ2kj9qaOHLNQBzLXecEDq0NSMR1/cFI9Pg7+cP4=; XFCS=A0BAA1D3C3AFF60D8A9501F61A5316EB2F44DC96D5D069E28D965E876B51558D; BAIDUID_BFESS=1FAD127BAC0642BD179AE9232E9D3EAC:FG=1; __yjs_duid=1_b83edfa36c48d34c5d422654ad9291ff1632462458498; BAIDUID=EB8C0978CD2A3182C0C963B26A4F83BC:FG=1; BDUSS=zBnQnprSmR3c0xvSDh1Wk5vT3pkMmpSN2tTTlc4R2g1dUJKS2pKUnhpSnVGM1poRVFBQUFBJCQAAAAAABAAAAEAAAD2Tdr6REO088rlMjAxOQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAG6KTmFuik5hN; BDUSS_BFESS=zBnQnprSmR3c0xvSDh1Wk5vT3pkMmpSN2tTTlc4R2g1dUJKS2pKUnhpSnVGM1poRVFBQUFBJCQAAAAAABAAAAEAAAD2Tdr6REO088rlMjAxOQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAG6KTmFuik5hN; pan_login_way=1; csrfToken=Q7ezNP5m-MPzubHlXKXZKmR0; STOKEN=a035eb4833e11aabcfaf438a90d977308679fbe717aa1381ff4a276541884cbe; ZD_ENTRY=empty; PANPSC=6330118974698879948:HSTAF2XekfrDfJxofQvIR8/yqoAddd3nU4bHmv7k1lQb6OtHeDgTZITtPba1v5pWKB+Q1NY39EqaV1QHy3lx2+uwJgkIjG1NcDLxProYXAAu/GN14ZZ7XobjAuQ0lbzSIpBwzouoN4Fjy4bwAz5jQiHq5mg/cPBDsGdcW9T0tiRm65hzsZIwfARwtfBixKqXMKjxtxPUcwo='");
echo shell_exec("/var/www/html/data/BaiduPCS-Go config set --ignore_illegal true");
echo shell_exec("/var/www/html/data/BaiduPCS-Go config set -max_upload_parallel 99");
echo shell_exec("/var/www/html/data/BaiduPCS-Go config set -pcs_addr c4.pcs.baidu.com");








if ($ifbd === 'Cancel') { 
    echo shell_exec("$ifbd /var/www/html/data/BaiduPCS-Go upload /var/www/html/$gdname/* '$bddir' --retry 38 -l 2 > /var/www/html/remote上传百度网盘日志1.txt 2>&1");
	   
}
 else {
      shell_exec(" /var/www/html/data/BaiduPCS-Go upload /var/www/html/$gdname/* '$bddir' -l 2 --retry 38  > /var/www/html/remote上传百度网盘日志.txt 2>&1"); //如果开代理运行此命令
 }

shell_exec("rm -rf /usr/share/httpd/.config/BaiduPCS-Go");
//上传百度网盘------------------------
	

//exit;
			
//上传115网盘------------------------
echo shell_exec("find /var/www/html/remote$mvorlive/* -maxdepth 3 -size -5000k -delete"); //删除小文件
echo shell_exec("find /var/www/html/remote$mvorlive/  -type f -name *.part -delete"); //删除小文件
echo shell_exec("curl https://362227.top/fake115uploader.json > /var/www/html/data/fake115uploader.json");

sleep (3);
$txt = shell_exec("curl -L https://crowncloud.362227.top/remote/remote上传百度网盘日志.php");
if (strstr($txt, "以下文件上传失败") || strstr($txt, "加入上传队列")){    //如有 "以下文件上传失败"或者"加入上传队列"，就停止脚本
    exit;}


if ($if115 === 'Cancel') { 
    echo shell_exec("$if115 /var/www/html/data/fake115uploader  -e -c $dir115 -u /var/www/html/remote115/* > '/var/www/html/remote上传115网盘日志.txt' 2>&1");
    echo shell_exec("find /var/www/html/$gdname/  -type f -name * -delete"); //删除文件
	   
}
 else {
shell_exec("find /var/www/html/$gdname/* -maxdepth 3 -size -5000k -delete"); //删除小文件
shell_exec("rm -rf /var/www/html/$gdname/*.part"); //删除临时文件
shell_exec("rm -rf /var/www/html/$gdname/*megatmp*"); //删除临时文件
shell_exec("rm -rf /var/www/html/$gdname/*.ytdl"); //删除临时文件
shell_exec("rm -rf /var/www/html/$gdname/*.part-Frag*"); //删除临时文件
shell_exec("rm -rf /var/www/html/$gdname/*.aria2"); //删除临时文件
echo shell_exec("find /var/www/html/$gdname -maxdepth 3 -type f -exec mv {} /var/www/html/remote115$mvorlive/ \;");
//echo shell_exec("mv /var/www/html/$gdname/* /var/www/html/remote115$mvorlive > 移动.txt");
 //    echo shell_exec("mv /var/www/html/$gdname/* /var/www/html/remote115$mvorlive > 移动.txt"); //移动到115文件夹，准备上传115网盘
     //echo shell_exec("$if115 /var/www/html/data/fake115uploader -retry 3 -e -c $dir115 -u /var/www/html/remote115/* > '/var/www/html/remote上传115网盘日志.txt' 2>&1"); 
 }


$fp = '/var/www/html/remote115/';  
   function is_empty_dir($fp)    //判断文件夹是否有文件，返回1表示有文件，返回2表示没有
    {    
        $H = @opendir($fp); 
        $i=0;    
        while($_file=readdir($H)){    
            $i++;    
        }    
        closedir($H);    
        if($i>2){ 
            return 1; 
        }else{ 
            return 2;  //true
        } 
    }

//如果文件夹不为空，执行下列命令
if (is_empty_dir($fp) === 1 ) {echo shell_exec("$if115 /var/www/html/data/fake115uploader -parts-num 17 -e -c $dir115 -m /var/www/html/remote115/* >> '/var/www/html/remote上传115网盘日志.txt' 2>&1");}
//上传115度网盘------------------------

	
echo '这里的输出用户看不到，后台运行的';
//下面代码的任何输出都不会输出给浏览器，因为http连接已经关了，
//所以下面的代码的执行属于后台运行的
ignore_user_abort(true); // 后台运行，这个只是运行浏览器关闭，并不是直接就中止返回200状态。
set_time_limit(7600); // 脚本最多运行1个小时
runRack();
function runRack()
{
file_put_contents("/usr/share/nginx/kodexplorer/data/User/admin/home/10362227/runBack.txt", "后台运行输出结果");
}
	
	
?>
</div>
<p>
	
<?php


	
}



$content = file_get_contents("remotecmd.txt");
echo $content;
	
	

if(file_exists("remotehtmlurl.txt")) {$line = count(file('remotehtmlurl.txt'));} //获取行数
echo '链接('.$line.')：'.file_get_contents("remotehtmlurl.txt");
				      
//if(file_exists("remote下载日志.txt")) {echo '<a href="查看UTF8完整版日志.php?file=remote下载日志.txt" target="_blank"><h3>下载进度</h3></a>';}
//$content = file_get_contents("remote下载日志.txt");
//$content = preg_replace('/[\s\S]*(\[download\].*)/','$1', $content); //不包含文件名
//echo $content;
echo '<div id="dl"></div>';
	
//if(file_exists("remote下载日志.txt")) {echo '<a href="查看UTF8完整版日志.php?file=remote上传谷歌网盘日志.txt" target="_blank"><h3>上传谷歌网盘进度</h3></a>';}
//$content = file_get_contents("/var/www/html/remote上传谷歌网盘.txt");	
//$content = preg_replace('/[\s\S]*([\s\S]{180}$)/','$1', $content); //读取后面180个字符
echo '<div id="rclone"></div>';
	
if(file_exists("remote上传百度日志.txt")) {echo '<a href="查看UTF8完整版日志.php?file=remote上传百度网盘日志.txt" target="_blank"><h3>上传百度网盘进度</h3></a>';}
//$content = file_get_contents("/var/www/html/remote上传百度网盘.txt");	
//$content = preg_replace('/[\s\S]*([\s\S]{180}$)/','$1', $content); //读取后面180个字符
//echo $content;
echo '<div id="bd"></div>';

//if(file_exists("remote上传115日志.txt")) {echo '<a href="查看UTF8完整版日志.php?file=remote上传115网盘日志.txt" target="_blank"><h3>上传115网盘进度</h3></a>';}
//$content = file_get_contents("/var/www/html/remote上传115网盘.txt");	
//$content = preg_replace('/[\s\S]*([\s\S]{280}$)/','$1', $content); //读取后面280个字符
echo '<div id="115"></div>';
	

echo '<style type="text/css">
/* General styles */
BODY {
	background-color:#EAECEE;
	font-family:Verdana;
	font-size:small;
}
A {
	color: #000000;
	text-decoration: none;
}
A:hover {
	text-decoration: underline;
}
#top {
	width:100%;
	padding-bottom: 20px;
}
#top a span, #top a:hover, #top a span:hover{
	color:#68a9d2;
	font-weight:bold;
	text-align:center;
	font-size:large;
}
#top a {
	display:block;
	padding:20px 0 0 0;
}
#top span {
	display:block;
}
div.subtitle{
	width:80%;
	margin: 0 auto;
	color:#68a9d2;
	text-align:center;
}
#frame {
	border: 1px solid #CDD2D6;
	text-align:left;
	position: relative;
	margin: 0 auto;
	max-width:auto;
	overflow:hidden;
}
#error {
	max-width:450px;
	background-color:#EAECEE;
	color:#EAECEE;
	padding:7pt;
	position: relative;
	margin: 10pt auto;
	text-align:center;
	border: 1px dotted #CDD2D6;
}
input {
	border: 1px solid #CDD2D6;
}
.bar{
	width:100%;
	clear:both;
	height:1px;
}
/* File list */
table.table {
	width:100%;
	border-collapse: collapse;
	table-layout: fixed;
	word-wrap: break-word;
}
table.table td{
	padding:3px;
}
table.table tr.row.two {
	background-color:#E3E6F0;
}
table.table tr.row.one {
	background-color:#f8f9fa;
}
table.table tr.row td.icon {
	width:25px;
	padding-top:3px;
	padding-bottom:1px;
}
table.table td.del {
	width:25px;
}
table.table tr.row td.size {
	width: 100px;
	text-align: right;
}
table.table tr.row td.changed {
	width: 150px;
	text-align: center;
}
table.table tr.header img {
	vertical-align:bottom;
}
table img{
	border:0;
}
/* Info area */
#info {
	color:#000000;
	font-family:Verdana;
	max-width:680px;
	position: relative;
	margin: 0 auto;
	text-align:center;
}
/* Thumbnail area */
#thumb {
	position:absolute;
	border: 1px solid #CDD2D6;
	background:#f8f9fa;
	display:none;
	padding:3px;
}
#thumb img {
	display:block;
}
/* Login bar (at the bottom of the page) */
#login_bar {
	margin: 0 auto;
	margin-top:2px;
	max-width:680px;
}
#login_bar input.submit{
	float:right;
}
/* Upload area */
#upload {
	margin: 0 auto;
	margin-top:2px;
	max-width:680px;
}
#upload #password_container {
	margin-right:20px;
}
#upload #newdir_container, #upload #password_container {
	float:left;
}
#upload #upload_container{
	float:right;
}
#upload input.upload_dirname, #upload input.upload_password{
	width:140px;
}
#upload input.upload_file{
	font-size:small;
}
/* Breadcrumbs */
div.breadcrumbs {
	display:block;
	padding:1px 3px;
	color:#cccccc;
	font-size:x-small;
}
div.breadcrumbs a{
	display:inline-block;
	color:#cccccc;
	padding:2px 0;
	font-size:small;
}
/* Login area */
#login {
	max-width:280px;
	text-align:right;
	margin:15px auto 50px auto;
}
#login div {
	display:block;
	width:100%;
	margin-top:5px;
}
#login label{
	width: 120px;
	text-align: right;
}
/* Mobile interface */
body.mobile #frame, body.mobile #info, body.mobile #upload {
	max-width:none;
}
body.mobile {
	font-size:medium;
}
body.mobile a.item {
	display:block;
	padding:10px 0;
}
body.mobile a.item span.size {
	float:right;
	margin-left:10px;
}
body.mobile table.table {
	margin-bottom:30px;
}
body.mobile table.table tr td {
	border-top: 1px solid #CDD2D6;
}
body.mobile table.table tr.last td {
	border-bottom: 1px solid #CDD2D6;
}
body.mobile #top {
	padding-bottom:3px;
}
body.mobile #top a {
	padding-top:3px;
}
body.mobile #upload #password_container, body.mobile #upload #upload_container, body.mobile #upload #newdir_container {
	float:none;
	margin-top:5px;
}
body.mobile #upload input.upload_dirname, body.mobile #upload input.upload_password{
	width:240px;
}
body.mobile #upload {
	margin-bottom:15px;
}
</style>
<body class="mobile">
<div id="frame">
<div id="top">
	
</div>
<body class="mobile">
';
	
//$actual_link = 'https://'.$_SERVER['HTTP_HOST']; 
//$page = file_get_contents($actual_link.'/encodeexplorer.index.php?m&sort_by=mod&sort_as=desc&dir=remote115/');

//$page = str_replace("src=\"?img","src=\"encodeexplorer.index.php?img",$page);
//$page = str_replace("<a href=\"?s&amp;dir=remote115/\">","<a href=\"encodeexplorer.index.php?sort_by=mod&sort_as=desc&dir=remote115/\">",$page);
//echo '<p hidden>'.$page.'</p>';
	
echo '<div id="file"></div>';	


?>
</p>

<p align="center"><a href="查看UTF8完整版日志.php?file=remote下载日志.txt" target="_blank"><font size="2">下载日志</font></a>  ·  <a href="查看UTF8完整版日志.php?file=remote上传百度网盘日志.txt" target="_blank"><font size="2">上传百度网盘日志</font></a>  ·  <a href="查看UTF8完整版日志.php?file=remote上传115网盘日志.txt" target="_blank"><font size="2">上传115网盘日志</font>  ·  <a href="https://my.jdownloader.org/index.html?deviceId=01231e5586f0354abd9b14f4f7a9b549#webinterface:links" target="_blank"><font size="2">JDownloader</font></a></p>





</body>
</body>
</html>

<?php



// error_reporting(0);

function __($message) {
	$messages = array(
		'Download' => '文件下载',
		'Gateway' => '网关管理',
		'Log Analysis' => '日志分析',
		'Monitor' => '性能监控',
		'Server Information' => '服务器参数',
		'IP Address' => 'IP 地址',
		'Client Infomation' => '客户端信息',
		'Uname' => '内核标识',
		'OS' => '操作系统',
		'Server Software' => '服务器软件',
		'Language' => '语言',
		'Port' => '端口',
		'User' => '用户',
		'Hostname' => '主机名称',
		'Server Port' => '端口',
		'Prober Path' => '探针路径',
		'Server Realtime Data' => '服务器实时数据',
		'Time' => '当前时间',
		'Uptime' => '已运行时间',
		'CPU Model' => 'CPU 型号',
		'L2 Cache' => '二级缓存',
		'Frequency' => '频率',
		'CPU Instruction Set' => 'CPU 指令集',
		'BIOS Version' => 'BIOS 版本',
		'Board Vendor' => '主板厂商',
		'HardDisk Model' => '硬盘型号',
		'CPU Usage' => 'CPU 使用状况',
		'CPU Temperature' => 'CPU 温度',
		'GPU Temperature' => 'GPU 温度',
		'Memory Usage' => '内存使用状况',
		'Physical Memory' => '物理内存',
		'Used' => '已用',
		'Cached' => '已缓存',
		'Free' => '空闲',
		'Percent' => '使用率',
		'Total Space' => '总空间',
		'Disk Usage' => '硬盘使用状况',
		'Loadavg' => '系统平均负载',
		'Sockets' => '网络连接数',
		'Network Usage' => '网络使用状况',
		'Tx' => '出网',
		'Rx' => '入网',
		'Realtime' => '实时',
		'Network Neighborhood' => '网络邻居',
		'Type' => '类型',
		'Device' => '设备',
		'PHP Information' => 'PHP 信息',
		'Version' => '版本',
		'Zend OpCache' => 'Zend OpCache',
		'Server API' => '服务器接口',
		'Memory Limit' => '内存限制',
		'POST Max Size' => '最大上传大小',
		'Upload Max FileSize' => '最大上传文件',
		'Max Execution Time' => '最大执行时间',
		'Default Socket Timeout' => '默认 Socket 超时',
		'PHP Extension' => 'PHP 扩展',
		'Prober' => '探针',
		'Turbo Version' => '极速版',
		'Back to top' => '返回顶部',
	);

	if (substr($_SERVER['HTTP_ACCEPT_LANGUAGE'], 0, 2) === 'zh') {
		print isset($messages[$message]) ? $messages[$message] : $message;
	} else {
		print $message;
	}
}

function human_filesize($bytes) {
	if ($bytes == 0)
		return '0 B';

	$units = array('B','K','M','G','T');
	$size = '';

	while ($bytes > 0 && count($units) > 0)
	{
		$size = strval($bytes % 1024) . ' ' .array_shift($units) . ' ' . $size;
		$bytes = intval($bytes / 1024);
	}

	return $size;
}

function get_remote_addr()
{
	if (isset($_SERVER["HTTP_X_REAL_IP"]))
	{
		return $_SERVER["HTTP_X_REAL_IP"];
	}
	else if (isset($_SERVER["HTTP_X_FORWARDED_FOR"]))
	{
		return preg_replace('/^.+,\s*/', '', $_SERVER["HTTP_X_FORWARDED_FOR"]);
	}
	else
	{
		return $_SERVER["REMOTE_ADDR"];
	}
}

function get_server_addr()
{
	if ($_SERVER["SERVER_ADDR"] != "127.0.0.1")
	{
		return $_SERVER["SERVER_ADDR"];
	}
	else
	{
		return gethostbyname(php_uname('n'));
	}
}

function get_stat()
{
	$content = file('/proc/stat');
	$array = array_shift($content);
	$array = preg_split('/\s+/', trim($array));
	return array_slice($array, 1);
}

function get_sockstat()
{
	$info = array();

	$content = file('/proc/net/sockstat');
	foreach ($content as $line) {
		$parts = explode(':', $line);
		$key = trim($parts[0]);
		$values = preg_split('/\s+/', trim($parts[1]));
		$info[$key] = array();
		for ($i = 0; $i < count($values); $i += 2) {
			$info[$key][$values[$i]] = $values[$i+1];
		}
	}

	return $info;
}

function get_cpuinfo()
{
	$info = array();

	if (!($str = @file("/proc/cpuinfo")))
		return false;

	$str = implode("", $str);
	@preg_match_all("/processor\s{0,}\:+\s{0,}([\w\s\)\(\@.-]+)([\r\n]+)/s", $str, $processor);
	@preg_match_all("/model\s+name\s{0,}\:+\s{0,}([\w\s\)\(\@.-]+)([\r\n]+)/s", $str, $model);

	if (count($model[0]) == 0)
	{
		@preg_match_all("/Hardware\s{0,}\:+\s{0,}([\w\s\)\(\@.-]+)([\r\n]+)/s", $str, $model);
	}
	@preg_match_all("/cpu\s+MHz\s{0,}\:+\s{0,}([\d\.]+)[\r\n]+/", $str, $mhz);

	if (count($mhz[0]) == 0)
	{
		$values = @file("/sys/devices/system/cpu/cpu0/cpufreq/cpuinfo_max_freq");
		$mhz = array("", array(sprintf('%.3f', intval($values[0])/1000)));
	}

	@preg_match_all("/cache\s+size\s{0,}\:+\s{0,}([\d\.]+\s{0,}[A-Z]+[\r\n]+)/", $str, $cache);
	@preg_match_all("/(?i)bogomips\s{0,}\:+\s{0,}([\d\.]+)[\r\n]+/", $str, $bogomips);
	@preg_match_all("/(?i)(flags|Features)\s{0,}\:+\s{0,}(.+)[\r\n]+/", $str, $flags);

	$zh = (substr($_SERVER['HTTP_ACCEPT_LANGUAGE'], 0, 2) === 'zh');

	if (is_array($model[1]))
	{
		$info['num'] = sizeof($processor[1]);
		$info['model'] = $model[1][0];
		$info['frequency'] = $mhz[1][0];
		$info['bogomips'] = $bogomips[1][0];
		if (count($cache[0]) > 0)
			$info['l2cache'] = trim($cache[1][0]);
		$info['flags'] = $flags[2][0];
	}

	return $info;
}

function get_uptime()
{
	if (!($str = @file('/proc/uptime')))
		return false;

	$zh = (substr($_SERVER['HTTP_ACCEPT_LANGUAGE'], 0, 2) === 'zh');

	$uptime = '';
	$str = explode(' ', implode('', $str));
	$str = trim($str[0]);
	$min = $str / 60;
	$hours = $min / 60;
	$days = floor($hours / 24);
	$hours = floor($hours - ($days * 24));
	$min = floor($min - ($days * 60 * 24) - ($hours * 60));
	$duint = !$zh ? (' day'. ($days > 1 ? 's ':' ')) : '天';
	$huint = !$zh ? (' hour'. ($hours > 1 ? 's ':' ')) : '小时';
	$muint = !$zh ? (' minute'. ($min > 1 ? 's ':' ')) : '分钟';

	if ($days !== 0)
		$uptime = $days.$duint;
	if ($hours !== 0)
		$uptime .= $hours.$huint;
	$uptime .= $min.$muint;

	return $uptime;
}

function get_tempinfo()
{
	$info = array();

	if ($str = @file('/sys/class/thermal/thermal_zone0/temp'))
		$info['cpu'] = $str[0]/1000.0;

	#if ($str = @file('/sys/class/thermal/thermal_zone10/temp'))
	#	$info['gpu'] = $str[0]/1000.0;

	return $info;
}

function get_meminfo()
{
	$info = array();

	if (!($str = @file('/proc/meminfo')))
		return false;

	$str = implode('', $str);
	preg_match_all("/MemTotal\s{0,}\:+\s{0,}([\d\.]+).+?MemFree\s{0,}\:+\s{0,}([\d\.]+).+?Cached\s{0,}\:+\s{0,}([\d\.]+).+?SwapTotal\s{0,}\:+\s{0,}([\d\.]+).+?SwapFree\s{0,}\:+\s{0,}([\d\.]+)/s", $str, $buf);
	preg_match_all("/Buffers\s{0,}\:+\s{0,}([\d\.]+)/s", $str, $buffers);

	$info['memTotal'] = round($buf[1][0]/1024, 2);
	$info['memFree'] = round($buf[2][0]/1024, 2);
	$info['memBuffers'] = round($buffers[1][0]/1024, 2);
	$info['memCached'] = round($buf[3][0]/1024, 2);
	$info['memUsed'] = round($info['memTotal']-$info['memFree']-$info['memBuffers']-$info['memCached'], 2);
	$info['memUsedPercent'] = (floatval($info['memTotal'])!=0)?round($info['memUsed']/$info['memTotal']*100,2):0;
	$info['memBuffersPercent'] = (floatval($info['memTotal'])!=0)?round($info['memBuffers']/$info['memTotal']*100,2):0;
	$info['memCachedPercent'] = (floatval($info['memTotal'])!=0)?round($info['memCached']/$info['memTotal']*100,2):0;

	$info['swapTotal'] = round($buf[4][0]/1024, 2);
	$info['swapFree'] = round($buf[5][0]/1024, 2);
	$info['swapUsed'] = round($info['swapTotal']-$info['swapFree'], 2);
	$info['swapPercent'] = (floatval($info['swapTotal'])!=0)?round($info['swapUsed']/$info['swapTotal']*100,2):0;

	foreach ($info as $key => $value) {
		if (strpos($key, 'Percent') > 0)
			continue;
		if ($value < 1024)
			$info[$key] .= ' M';
		else
			$info[$key] = round($value/1024, 3) . ' G';
	}

	return $info;
}

function get_loadavg()
{
	if (!($str = @file('/proc/loadavg')))
		return false;

	$str = explode(' ', implode('', $str));
	$str = array_chunk($str, 4);
	$loadavg = implode(' ', $str[0]);

	return $loadavg;
}

function get_distname()
{
	foreach (glob('/etc/*release') as $name)
	{
		if ($name == '/etc/centos-release' || $name == '/etc/redhat-release' || $name == '/etc/system-release')
		{
			return array_shift(file($name));
		}

		$release_info = @parse_ini_file($name);

		if (isset($release_info['DISTRIB_DESCRIPTION']))
			return $release_info['DISTRIB_DESCRIPTION'];

		if (isset($release_info['PRETTY_NAME']))
			return $release_info['PRETTY_NAME'];
	}

	return php_uname('s').' '.php_uname('r');
}

function get_boardinfo()
{
	$info = array();

	if (is_file('/sys/class/dmi/id/bios_vendor'))
	{
		$info['BIOSVendor'] = array_shift(file('/sys/class/dmi/id/bios_vendor', FILE_IGNORE_NEW_LINES));
		$info['BIOSVersion'] = array_shift(file('/sys/class/dmi/id/bios_version', FILE_IGNORE_NEW_LINES));
		$info['BIOSDate'] = array_shift(file('/sys/class/dmi/id/bios_date', FILE_IGNORE_NEW_LINES));
	}

	if (is_file('/sys/class/dmi/id/board_name'))
	{
		$info['boardVendor'] = array_shift(file('/sys/class/dmi/id/board_vendor', FILE_IGNORE_NEW_LINES));
		$info['boardName'] = array_shift(file('/sys/class/dmi/id/board_name', FILE_IGNORE_NEW_LINES));
		$info['boardVersion'] = array_shift(file('/sys/class/dmi/id/board_version', FILE_IGNORE_NEW_LINES));
	}
	else if (is_file('/sys/class/dmi/id/product_name'))
	{
		$info['boardVendor'] = array_shift(file('/sys/class/dmi/id/product_name', FILE_IGNORE_NEW_LINES));
		$info['boardName'] = '';
		$info['boardVersion'] = '';
	}

	if (is_dir('/dev/disk/by-id'))
	{
		if ($names=array_filter(scandir('/dev/disk/by-id'), function($k) { return $k[0] != '.' && strpos($k, 'DVD-ROM') === false; }))
		{
			$parts = explode("_", array_shift($names));
			$parts = explode("-", array_shift($parts), 2);
			$info['diskVendor'] = strtoupper($parts[0]);
			$info['diskModel'] = $parts[1];
		}
	}

	return $info;
}

function get_diskinfo()
{
	$info = array();

	$info['diskTotal'] = round(@disk_total_space('.')/(1024*1024*1024),2);
	$info['diskFree'] = round(@disk_free_space('.')/(1024*1024*1024),2);
	$info['diskUsed'] = round($info['diskTotal'] - $info['diskFree'],2);
	$info['diskPercent'] = 0;
	if (floatval($info['diskTotal']) != 0)
		$info['diskPercent'] = round($info['diskUsed']/$info['diskTotal']*100, 2);

	return $info;
}

function get_netdev()
{
	$info = array();

	$strs = @file('/proc/net/dev');
	for ($i = 2; $i < count($strs); $i++ )
	{
		$parts = preg_split('/\s+/', trim($strs[$i]));
		$dev = trim($parts[0], ':');
		$info[$dev] = array(
			'rx' => intval($parts[1]),
			'human_rx' => human_filesize($parts[1]),
			'tx' => intval($parts[9]),
			'human_tx' => human_filesize($parts[9]),
		);
	}

	return $info;
}

function get_netarp()
{
	$info = array();

	$seen = array();
	$strs = @file('/proc/net/arp');
	for ($i = 1; $i < count($strs); $i++ )
	{
		$parts = preg_split('/\s+/', $strs[$i]);
		if ('0x2' == $parts[2] && !isset($seen[$parts[3]])) {
			$seen[$parts[3]] = true;
			$info[$parts[0]] = array(
				'hw_type' => $parts[1]=='0x1'?'ether':$parts[1],
				'hw_addr' => $parts[3],
				'device' => $parts[5],
			);
		}
	}

	return $info;
}

function my_json_encode($a=false)
{
	if (is_null($a))
		return 'null';
	if ($a === false)
		return 'false';
	if ($a === true)
		return 'true';
	if (is_scalar($a))
	{
		if (is_float($a))
		{
			return floatval(str_replace(',', '.', strval($a)));
		}
		if (is_string($a))
		{
			static $jsonReplaces = array(array("\\", "/", "\n", "\t", "\r", "\b", "\f", '"'), array('\\\\', '\\/', '\\n', '\\t', '\\r', '\\b', '\\f', '\"'));
			return '"' . str_replace($jsonReplaces[0], $jsonReplaces[1], $a) . '"';
		}
		else
			return $a;
	}
	$isList = true;
	for ($i = 0, reset($a); $i < count($a); $i++, next($a))
	{
		if (key($a) !== $i)
		{
			$isList = false;
			break;
		}
	}
	$result = array();
	if ($isList)
	{
		foreach ($a as $v)
			$result[] = my_json_encode($v);
		return '[' . join(',', $result) . ']';
	}
	else
	{
		foreach ($a as $k => $v)
			$result[] = my_json_encode($k).':'.my_json_encode($v);
		return '{' . join(',', $result) . '}';
	}
}

if (!function_exists('json_encode'))
{
	function json_encode($a)
	{
		return my_json_encode($a);
	}
}

if (isset($_GET['method'])) {
	switch ($_GET['method']) {
		case 'phpinfo':
			phpinfo();
			exit;
		case 'sysinfo':
			echo json_encode(array(
				'stat' => get_stat(),
				'stime' => date('Y-m-d H:i:s'),
				'uptime' => get_uptime(),
				'tempinfo' => get_tempinfo(),
				'meminfo' => get_meminfo(),
				'loadavg' => get_loadavg(),
				'sockstat' => get_sockstat(),
				'diskinfo' => get_diskinfo(),
				'netdev' => get_netdev(),
			));
			exit;
	}
}

$time_start = microtime(true);
$stat = get_stat();
$LC_CTYPE = setlocale(LC_CTYPE, 0);
$uname = php_uname();
$stime = date('Y-m-d H:i:s');
$distname = get_distname();
$server_addr = get_server_addr();
$remote_addr = get_remote_addr();
$uptime = get_uptime();
$cpuinfo = get_cpuinfo();
$tempinfo = get_tempinfo();
$meminfo = get_meminfo();
$loadavg = get_loadavg();
$sockstat = get_sockstat();
$boardinfo = get_boardinfo();
$diskinfo = get_diskinfo();
$netdev = get_netdev();
$netarp = get_netarp();

@header("Content-Type: text/html; charset=utf-8");

?><!DOCTYPE html>
<meta charset="utf-8">
<title><?php echo $_SERVER['SERVER_NAME']; ?></title>
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="robots" content="noindex, nofollow">
<style>
body {
	margin: 0;
	font-family: "Helvetica Neue", "Luxi Sans", "DejaVu Sans", Tahoma, "Hiragino Sans GB", "Microsoft Yahei", sans-serif;
}
.container {
	padding-right: 15px;
	padding-left: 15px;
	margin-right: auto;
	margin-left: auto;
}
@media(min-width:768px) {
	.container {
		max-width: 750px;
	}
}
@media(min-width:992px) {
	.container {
		max-width: 970px;
	}
}
@media(min-width:1200px) {
	.container {
		max-width: 1170px;
	}
}
</style>

	<td><?php __('Disk Usage'); ?></td>
	<td colspan="3">
	<?php __('Total Space'); ?> <?php echo $diskinfo['diskTotal'];?>&nbsp;G，
	<?php __('Used'); ?> <span id="diskinfo_Used"><?php echo $diskinfo['diskUsed'];?></span>&nbsp;G，
	<?php __('Free'); ?> <span id="diskinfo_Free"><?php echo $diskinfo['diskFree'];?></span>&nbsp;G，
	<?php __('Percent'); ?> <span id="diskinfo_Percent"><?php echo $diskinfo['diskPercent'];?></span>%
	<div class="progress"><div id="diskinfo_UsedBar" class="progress-bar progress-bar-black" role="progressbar" style="width:<?php echo $diskinfo['diskPercent'];?>%" ></div> </div>
 
